[
  {
    "id": "1980621537620468091",
    "date": "2025-10-21T13:05:47+00:00",
    "content": "Numerous of our NOW GREAT ALLIES in the Middle East, and areas surrounding the Middle East, have explicitly and strongly, with great enthusiasm, informed me that they would welcome the opportunity, at my request, to go into GAZA with a heavy force and \"straighten our Hamas\" if Hamas continues to act badly, in violation of their agreement with us. The love and spirit for the Middle East has not been seen like this in a thousand years! It is a beautiful thing to behold! I told these countries, and Israel, \"NOT YET!\" There is still hope that Hamas will do what is right. If they do not, an end to Hamas will be FAST, FURIOUS, & BRUTAL! I would like to thank all of those countries that called to help. Also, I would like to thank the great and powerful country of Indonesia, and its wonderful leader, for all of the help they have shown and given to the Middle East, and to the U.S.A. TO EVERYONE, thank you for your attention to this matter! PRESIDENT DONALD J. TRUMP",
    "url": "https://x.com/trump_repost/status/1980621537620468091",
    "user": "trump_repost"
  },
  {
    "id": "1980446842036044024",
    "date": "2025-10-21T01:31:36+00:00",
    "content": "https://t.co/1LqWPLik3Y",
    "url": "https://x.com/trump_repost/status/1980446842036044024",
    "user": "trump_repost"
  },
  {
    "id": "1980406381690909184",
    "date": "2025-10-20T22:50:50+00:00",
    "content": "The FBI, under my Administration, is doing an incredible job. Since January 20th, more than 28,000 Violent Criminals have been arrested (RECORD BREAKING!), with over 6,000 illegal weapons seized, more than 1,700 child predators and 300 human traffickers taken off the streets, 5,000 innocent children rescued, 2,000 Criminal Enterprises disrupted, 1,900 kilos of Fentanyl (Enough to kill 125 Million people!) taken out — HISTORIC RESULTS. We are bringing LAW AND ORDER back to America. Kash, Dan, Andrew, and the men and women of the FBI, are doing a tremendous job, MAKING AMERICA SAFE AGAIN!",
    "url": "https://x.com/trump_repost/status/1980406381690909184",
    "user": "trump_repost"
  },
  {
    "id": "1980406367803564357",
    "date": "2025-10-20T22:50:46+00:00",
    "content": "JACK CIATTARELLI IS A WINNER FOR NEW JERSEY! Mikie Sherrill is the exact opposite, a stone cold loser, who will drive your Energy costs through the roof, just like the Democrats are doing all over the Country but, even more so, because she has no understanding of what she is doing. Put simply, Jack Ciattarelli will bring your Energy costs down to a new low, and Mikie Sherrill will do the exact opposite — Energy costs under her will go up by levels never seen before. Mikie has no clue as to what she is doing. NEW JERSEY, VOTE FOR JACK CIATTARELLI — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1980406367803564357",
    "user": "trump_repost"
  },
  {
    "id": "1980406345624089007",
    "date": "2025-10-20T22:50:41+00:00",
    "content": "Jack Ciattarelli, the wonderful New Jersey Gubernatorial Candidate that is doing very well in the Polls against a very Fake and Corrupt Mikie Sherrill, will bring Energy prices down in New Jersey by record amounts. He calls me constantly, wanting assurances that I will use the Power of Common Sense on helping New Jersey with their Energy bills, which are going up by record amounts. Jack is a man who will bring costs and prices down, rapidly, but in particular, Energy costs, because he knows that everything else will follow. Mikie Sherrill, on the contrary, has Energy policies and concepts that will double and triple prices in New Jersey. Unlike Jack, there have been no calls to Washington saying, \"What do we do with these rapidly rising Electric and other costs?\" I have brought Energy way down, with Gasoline soon to hit $2, with everything else following! If Mikie, who was essentially thrown out of her school for cheating, and wasn't even allowed to walk through the Graduating Class, is ever involved with Government, Energy prices will soar at a record level! Unlike Jack Ciattarelli, nobody from her group is calling the White House in order to take advantage of the record drops in overall Energy costs. Jack Ciattarelli is a good man, who understands business, and who will bring down Energy, and other costs, by 50%, and even more. The unusually named Mikie, perhaps her only asset, will drive Energy costs up, like no Governor in History. She will be a DISASTER for New Jersey — VOTE JACK CIATTARELLI — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1980406345624089007",
    "user": "trump_repost"
  },
  {
    "id": "1980385032184484175",
    "date": "2025-10-20T21:26:00+00:00",
    "content": "I am pleased to announce that ground has been broken on the White House grounds to build the new, big, beautiful White House Ballroom. Completely separate from the White House itself, the East Wing is being fully modernized as part of this process, and will be more beautiful than ever when it is complete! For more than 150 years, every President has dreamt about having a Ballroom at the White House to accommodate people for grand parties, State Visits, etc. I am honored to be the first President to finally get this much-needed project underway — with zero cost to the American Taxpayer! The White House Ballroom is being privately funded by many generous Patriots, Great American Companies, and, yours truly. This Ballroom will be happily used for Generations to come! President DJT",
    "url": "https://x.com/trump_repost/status/1980385032184484175",
    "user": "trump_repost"
  },
  {
    "id": "1980364929170567530",
    "date": "2025-10-20T20:06:07+00:00",
    "content": "I am proud to announce the nomination of Alexander Van Hook to serve as Judge on the United States District Court for the Western District of Louisiana. Alexander attended Centenary College of Louisiana, before attending Louisiana State University for his Juris Doctorate. As Acting United States Attorney for the Western District of Louisiana and, previously, as prosecutor in that same office for more than 25 years, Alexander has proven his commitment to serving the incredible people of Louisiana, and protecting their Constitutional Rights. I have total confidence that Alexander will continue to serve his State, and our Country, with great distinction in this new role. Congratulations Alexander!",
    "url": "https://x.com/trump_repost/status/1980364929170567530",
    "user": "trump_repost"
  },
  {
    "id": "1980364914792493393",
    "date": "2025-10-20T20:06:03+00:00",
    "content": "I am pleased to announce the nomination of William Crain to serve as Judge on the United States District Court for the Eastern District of Louisiana. William is a proud Graduate of Louisiana State University, and has dedicated his life to serving Louisiana, a place I love, and won BIG three times. As a longtime State Court Judge and, currently, as Justice on the Louisiana Supreme Court, William has proven he has the Wisdom and Courage required to put our Constitution, FIRST. Now, more than ever, we need Judges who will hold violent criminals accountable, enforce the Rule of Law, and protect our Inalienable Rights. I trust William, who is highly qualified and respected, to continue to make his State, and our Nation, proud. Congratulations William!",
    "url": "https://x.com/trump_repost/status/1980364914792493393",
    "user": "trump_repost"
  },
  {
    "id": "1980351552796909891",
    "date": "2025-10-20T19:12:57+00:00",
    "content": "https://t.co/fbxMm4ghOn",
    "url": "https://x.com/trump_repost/status/1980351552796909891",
    "user": "trump_repost"
  },
  {
    "id": "1980028996189581384",
    "date": "2025-10-19T21:51:14+00:00",
    "content": "https://t.co/6fnSum1ZrT",
    "url": "https://x.com/trump_repost/status/1980028996189581384",
    "user": "trump_repost"
  },
  {
    "id": "1979990618383503520",
    "date": "2025-10-19T19:18:44+00:00",
    "content": "https://t.co/hDi3X3MAY6",
    "url": "https://x.com/trump_repost/status/1979990618383503520",
    "user": "trump_repost"
  },
  {
    "id": "1979986084764516611",
    "date": "2025-10-19T19:00:43+00:00",
    "content": "I'm pleased to announce Mark Savaya will serve as Special Envoy to the Republic of Iraq. Mark's deep understanding of the Iraq-U.S. relationship, and his connections in the region, will help advance the interests of the American people. Mark was a key player in my campaign in Michigan, where he, and others, helped secure a record vote with Muslim Americans. Congratulations, Mark!",
    "url": "https://x.com/trump_repost/status/1979986084764516611",
    "user": "trump_repost"
  },
  {
    "id": "1979911706953572715",
    "date": "2025-10-19T14:05:10+00:00",
    "content": "Everybody: I am interviewed by the great Maria Bartiromo, RIGHT NOW, on FoxNews. Enjoy",
    "url": "https://x.com/trump_repost/status/1979911706953572715",
    "user": "trump_repost"
  },
  {
    "id": "1979910456409264510",
    "date": "2025-10-19T14:00:12+00:00",
    "content": "President Gustavo Petro, of Colombia, is an illegal drug leader strongly encouraging the massive production of drugs, in big and small fields, all over Colombia. It has become the biggest business in Colombia, by far, and Petro does nothing to stop it, despite large scale payments and subsidies from the USA that are nothing more than a long term rip off of America. AS OF TODAY, THESE PAYMENTS, OR ANY OTHER FORM OF PAYMENT, OR SUBSIDIES, WILL NO LONGER BE MADE TO COLOMBIA. The purpose of this drug production is the sale of massive amounts of product into the United States, causing death, destruction, and havoc. Petro, a low rated and very unpopular leader, with a fresh mouth toward America, better close up these killing fields immediately, or the United States will close them up for him, and it won't be done nicely. Thank you for your attention to this matter! President Donald J. Trump",
    "url": "https://x.com/trump_repost/status/1979910456409264510",
    "user": "trump_repost"
  },
  {
    "id": "1979762811766198588",
    "date": "2025-10-19T04:13:31+00:00",
    "content": "https://t.co/vxM0STnDp2",
    "url": "https://x.com/trump_repost/status/1979762811766198588",
    "user": "trump_repost"
  },
  {
    "id": "1979762417765941552",
    "date": "2025-10-19T04:11:57+00:00",
    "content": "https://t.co/wXSfQHUilz",
    "url": "https://x.com/trump_repost/status/1979762417765941552",
    "user": "trump_repost"
  },
  {
    "id": "1979762098893983794",
    "date": "2025-10-19T04:10:41+00:00",
    "content": "» Mark Levin 'sick and tired' of 'constant drumbeat' that Trump's an authoritarian https://t.co/19TYDP0Q2O",
    "url": "https://x.com/trump_repost/status/1979762098893983794",
    "user": "trump_repost"
  },
  {
    "id": "1979738501022371852",
    "date": "2025-10-19T02:36:55+00:00",
    "content": "https://t.co/9u93yFzvbF",
    "url": "https://x.com/trump_repost/status/1979738501022371852",
    "user": "trump_repost"
  },
  {
    "id": "1979732233595564464",
    "date": "2025-10-19T02:12:00+00:00",
    "content": "https://t.co/jd8yhs6JVs",
    "url": "https://x.com/trump_repost/status/1979732233595564464",
    "user": "trump_repost"
  },
  {
    "id": "1979732036215873857",
    "date": "2025-10-19T02:11:13+00:00",
    "content": "https://t.co/WcaMnX9EJp",
    "url": "https://x.com/trump_repost/status/1979732036215873857",
    "user": "trump_repost"
  },
  {
    "id": "1979731815687688626",
    "date": "2025-10-19T02:10:21+00:00",
    "content": "https://t.co/OYTQjlGYTS",
    "url": "https://x.com/trump_repost/status/1979731815687688626",
    "user": "trump_repost"
  },
  {
    "id": "1979727050828357722",
    "date": "2025-10-19T01:51:25+00:00",
    "content": "https://t.co/PtRnwiGlGd",
    "url": "https://x.com/trump_repost/status/1979727050828357722",
    "user": "trump_repost"
  },
  {
    "id": "1979726838604972491",
    "date": "2025-10-19T01:50:34+00:00",
    "content": "https://t.co/dTavUQbVhb",
    "url": "https://x.com/trump_repost/status/1979726838604972491",
    "user": "trump_repost"
  },
  {
    "id": "1979726656878370974",
    "date": "2025-10-19T01:49:51+00:00",
    "content": "https://t.co/678hpSUgjQ",
    "url": "https://x.com/trump_repost/status/1979726656878370974",
    "user": "trump_repost"
  },
  {
    "id": "1979725873415917616",
    "date": "2025-10-19T01:46:44+00:00",
    "content": "https://t.co/t9VatuKHiU",
    "url": "https://x.com/trump_repost/status/1979725873415917616",
    "user": "trump_repost"
  },
  {
    "id": "1979725217670058101",
    "date": "2025-10-19T01:44:08+00:00",
    "content": "RT @RedEagleUpdates: 🚨BREAKING: Speaker Mike Johnson announces House GOP will introduce bill requiring voters to prove US citizenship. \n\nDo…",
    "url": "https://x.com/trump_repost/status/1979725217670058101",
    "user": "trump_repost"
  },
  {
    "id": "1979723742432591974",
    "date": "2025-10-19T01:38:16+00:00",
    "content": "https://t.co/sci1U9vDXR",
    "url": "https://x.com/trump_repost/status/1979723742432591974",
    "user": "trump_repost"
  },
  {
    "id": "1979723577604878735",
    "date": "2025-10-19T01:37:37+00:00",
    "content": "https://t.co/tByRUZxdxS",
    "url": "https://x.com/trump_repost/status/1979723577604878735",
    "user": "trump_repost"
  },
  {
    "id": "1979723406145925528",
    "date": "2025-10-19T01:36:56+00:00",
    "content": "RT @LynneBP_294: Giorgia Meloni defies EU, pursues direct Trump trade deal! Bravo, Meloni! \n🇺🇸 🇮🇹 This is a brilliant move! 🔥 https://t.co/…",
    "url": "https://x.com/trump_repost/status/1979723406145925528",
    "user": "trump_repost"
  },
  {
    "id": "1979684483789095068",
    "date": "2025-10-18T23:02:16+00:00",
    "content": "https://t.co/kWPfGFuG5e",
    "url": "https://x.com/trump_repost/status/1979684483789095068",
    "user": "trump_repost"
  },
  {
    "id": "1979619996620980651",
    "date": "2025-10-18T18:46:01+00:00",
    "content": "It was my great honor to destroy a very large DRUG-CARRYING SUBMARINE that was navigating towards the United States on a well known narcotrafficking transit route. U.S. Intelligence confirmed this vessel was loaded up with mostly Fentanyl, and other illegal narcotics. There were four known narcoterrorists on board the vessel. Two of the terrorists were killed. At least 25,000 Americans would die if I allowed this submarine to come ashore. The two surviving terrorists are being returned to their Countries of origin, Ecuador and Colombia, for detention and prosecution. No U.S. Forces were harmed in this strike. Under my watch, the United States of America will not tolerate narcoterrorists trafficking illegal drugs, by land or by sea. Thank you for your attention to this matter!\n\nDONALD J. TRUMP\nPRESIDENT OF THE UNITED STATES OF AMERICA",
    "url": "https://x.com/trump_repost/status/1979619996620980651",
    "user": "trump_repost"
  },
  {
    "id": "1979516940038398350",
    "date": "2025-10-18T11:56:30+00:00",
    "content": "RT @trump_repost: A \"Blue Slip\" means that if you're a Republican President, and there happens to be just one Democrat Senator in a state w…",
    "url": "https://x.com/trump_repost/status/1979516940038398350",
    "user": "trump_repost"
  },
  {
    "id": "1979516871310455170",
    "date": "2025-10-18T11:56:14+00:00",
    "content": "RT @trump_repost: The meeting with President Volodymyr Zelenskyy of Ukraine was very interesting, and cordial, but I told him, as I likewis…",
    "url": "https://x.com/trump_repost/status/1979516871310455170",
    "user": "trump_repost"
  },
  {
    "id": "1979314274150551615",
    "date": "2025-10-17T22:31:11+00:00",
    "content": "Third Rate Congressman Thomas Massie, a Weak and Pathetic RINO from the Great Commonwealth of Kentucky, a place I love, and won big SIX TIMES, must be thrown out of office, ASAP! The incredible people of Kentucky's 4th Congressional District gave us a mandate to, MAKE AMERICA GREAT AGAIN, and the person that will help us do that is Navy SEAL, Army Ranger, and Fifth Generation Kentucky Farmer, Captain Ed Gallrein, a true America First Patriot.\n \nA Brave Combat Veteran, Ed knows the Wisdom and Courage required to Defend our Country, Support our Military/Veterans, and Ensure PEACE THROUGH STRENGTH. Additionally, as a very successful Businessman, Ed knows how to Create GREAT Jobs, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Support our Amazing Farmers and American Agriculture, Unleash American Energy Dominance, and Champion our Nation's Golden Age. In Congress, he will fight tirelessly to Keep our now very Secure Border, SECURE, Stop Migrant Crime, and Defend our always under siege Second Amendment.\n \nI hope Ed gets into the Race against Massie, who is now polling at about 9% because the Great People of Kentucky are wise to him — He only votes against the Republican Party, making life very easy for the Radical Left. Unlike \"lightweight\" Massie, a totally ineffective LOSER who has failed us so badly, CAPTAIN ED GALLREIN IS A WINNER WHO WILL NOT LET YOU DOWN. Should he decide to challenge Massie, Captain Ed Gallrein has my Complete and Total Endorsement. RUN, ED, RUN — MAGA!",
    "url": "https://x.com/trump_repost/status/1979314274150551615",
    "user": "trump_repost"
  },
  {
    "id": "1979312989116469594",
    "date": "2025-10-17T22:26:05+00:00",
    "content": "Whatever happened to \"Senator\" Rand Paul? He was never great, but he went really BAD! I got him elected, TWICE (in the Great Commonwealth of Kentucky!), but he just never votes positively for the Republican Party. He's a nasty liddle' guy, much like \"Congressman\" Thomas Massie, aka Rand Paul Jr., also of Kentucky (which I won three times, in massive landslides!), a sick Wacko, who refuses to vote for our great Republican Party, MAGA, or America First. It's really weird!!!",
    "url": "https://x.com/trump_repost/status/1979312989116469594",
    "user": "trump_repost"
  },
  {
    "id": "1979307985517383836",
    "date": "2025-10-17T22:06:12+00:00",
    "content": "George Santos was somewhat of a \"rogue,\" but there are many rogues throughout our Country that aren't forced to serve seven years in prison. I started to think about George when the subject of Democrat Senator Richard \"Da Nang Dick\" Blumenthal came up again. As everyone remembers, \"Da Nang\" stated for almost twenty years that he was a proud Vietnam Veteran, having endured the worst of the War, watching the Wounded and Dead as he raced up the hills and down the valleys, blood streaming from his face. He was \"a Great Hero,\" he would leak to any and all who would listen — And then it happened! He was a COMPLETE AND TOTAL FRAUD. He never went to Vietnam, he never saw Vietnam, he never experienced the Battles there, or anywhere else. His War Hero status, and even minimal service in our Military, was totally and completely MADE UP. This is far worse than what George Santos did, and at least Santos had the Courage, Conviction, and Intelligence to ALWAYS VOTE REPUBLICAN! George has been in solitary confinement for long stretches of time and, by all accounts, has been horribly mistreated. Therefore, I just signed a Commutation, releasing George Santos from prison, IMMEDIATELY. Good luck George, have a great life!",
    "url": "https://x.com/trump_repost/status/1979307985517383836",
    "user": "trump_repost"
  },
  {
    "id": "1979290396707688592",
    "date": "2025-10-17T20:56:18+00:00",
    "content": "Thank you to North Carolina's incredible Republican State Legislators, who just introduced a new, fair, and improved, Congressional Map, a situation I am watching, and strongly supporting, very closely. It was my Great Honor to win North Carolina six times, including Primaries, in 2016, 2020, and 2024, and this new Map would give the fantastic people of North Carolina the opportunity to elect an additional MAGA Republican in the 2026 Midterm Elections, which would be A HUGE VICTORY for our America First Agenda, not just in North Carolina, but across our Nation. Remember, I won the Electoral College, 312-226, Counties Nationwide, 2,700 to 525, all seven Swing States (A LANDSLIDE!), and now I have the best Polling Numbers I've ever had. Our Party has never been more UNITED, and we are getting so much done for the American People because of it. Therefore, I encourage all of my Republican friends in the North Carolina Legislature to work as hard as they can to pass this new Map so that we can continue our incredible Record of SUCCESS. It is wonderful to see Republicans in \"The Tar Heel State\" standing up to Save our Country and, MAKE AMERICA GREAT AGAIN. THANK YOU NORTH CAROLINA — MAGA2026!",
    "url": "https://x.com/trump_repost/status/1979290396707688592",
    "user": "trump_repost"
  },
  {
    "id": "1979288971650961764",
    "date": "2025-10-17T20:50:38+00:00",
    "content": "The meeting with President Volodymyr Zelenskyy of Ukraine was very interesting, and cordial, but I told him, as I likewise strongly suggested to President Putin, that it is time to stop the killing, and make a DEAL! Enough blood has been shed, with property lines being defined by War and Guts. They should stop where they are. Let both claim Victory, let History decide! No more shooting, no more Death, no more vast and unsustainable sums of money spent. This is a War that would have never started if I were President. Thousands of people being slaughtered each and every week — NO MORE, GO HOME TO YOUR FAMILIES IN PEACE!",
    "url": "https://x.com/trump_repost/status/1979288971650961764",
    "user": "trump_repost"
  },
  {
    "id": "1979034789731799251",
    "date": "2025-10-17T04:00:37+00:00",
    "content": "A \"Blue Slip\" means that if you're a Republican President, and there happens to be just one Democrat Senator in a state where you are appointing a U.S. Attorney or District Court Judge, you will never be successful in getting a Republican confirmed. In other words, \"Blue Slips\" are a disaster, and I have eight GREAT Republican U.S. Attorney Candidates who will not be able to fulfill their service to the people of a state that voted overwhelmingly for me. The only one I can appoint is a Democrat, and that's not the deal. Nobody can say that is fair or, even, Constitutional. Thank you for your attention to this matter! President DJT.",
    "url": "https://x.com/trump_repost/status/1979034789731799251",
    "user": "trump_repost"
  },
  {
    "id": "1978995044913697191",
    "date": "2025-10-17T01:22:41+00:00",
    "content": "My wonderful granddaughter just launched a new Series on YouTube, \"1 on 1 with Kai.\" For her inaugural episode, we filmed our Golf Match at Trump National Golf Club, Washington, D.C. She has incredible golfing talent, and a bright future. Enjoy!",
    "url": "https://x.com/trump_repost/status/1978995044913697191",
    "user": "trump_repost"
  },
  {
    "id": "1978994730479554944",
    "date": "2025-10-17T01:21:26+00:00",
    "content": "The United States Air Force Academy Cadet Chapel has been a CONSTRUCTION DISASTER from the time it was built in 1962. The earlier stories are that it leaked on Day One, and that was the good part. Hundreds of Millions of Dollars have been spent. The renovation, which essentially has been going on since the day it was built, is now projected to go on until 2028, costing an additional $90 Million Dollars, bringing the grand total to $335 Million Dollars. This mess should be investigated. Very unfair to the Cadets — A COMPLETE ARCHITECTURAL CATASTROPHE!",
    "url": "https://x.com/trump_repost/status/1978994730479554944",
    "user": "trump_repost"
  },
  {
    "id": "1978994687173431449",
    "date": "2025-10-17T01:21:16+00:00",
    "content": "I have eight GREAT U.S. Attorneys, Highly Respected ALL, who will not be confirmed for their positions in various Highly Consequential States only because they're Republicans, and the Democrats have convinced Chuck Grassley to honor the stupid and outdated \"Blue Slip\" tradition, which precludes very talented and dedicated people from attaining High Office. The Democrats violate this practice in order to get people in, but Republicans just don't. These GREAT people's careers have been badly hurt by the Radical Left Democrats, using an old and ridiculous custom strictly to their advantage. What a shame!",
    "url": "https://x.com/trump_repost/status/1978994687173431449",
    "user": "trump_repost"
  },
  {
    "id": "1978895112039207284",
    "date": "2025-10-16T18:45:35+00:00",
    "content": "I am outraged that the International Maritime Organization is voting in London this week to pass a global Carbon Tax. The United States will NOT stand for this Global Green New Scam Tax on Shipping, and will not adhere to it in any way, shape, or form. We will not tolerate increased prices on American Consumers OR, the creation of a Green New Scam Bureaucracy to spend YOUR money on their Green dreams. Stand with the United States, and vote NO in London tomorrow!",
    "url": "https://x.com/trump_repost/status/1978895112039207284",
    "user": "trump_repost"
  },
  {
    "id": "1978876440893624746",
    "date": "2025-10-16T17:31:23+00:00",
    "content": "If Hamas continues to kill people in Gaza, which was not the Deal, we will have no choice but to go in and kill them. Thank you for your attention to this matter!",
    "url": "https://x.com/trump_repost/status/1978876440893624746",
    "user": "trump_repost"
  },
  {
    "id": "1978872484960301387",
    "date": "2025-10-16T17:15:40+00:00",
    "content": "I have just concluded my telephone conversation with President Vladimir Putin, of Russia, and it was a very productive one. President Putin congratulated me and the United States on the Great Accomplishment of Peace in the Middle East, something that, he said, has been dreamed of for centuries. I actually believe that the Success in the Middle East will help in our negotiation in attaining an end to the War with Russia/Ukraine. President Putin thanked the First Lady, Melania, for her involvement with children. He was very appreciative, and said that this will continue. We also spent a great deal of time talking about Trade between Russia and the United States when the War with Ukraine is over. At the conclusion of the call, we agreed that there will be a meeting of our High Level Advisors, next week. The United States' initial meetings will be led by Secretary of State Marco Rubio, together with various other people, to be designated. A meeting location is to be determined. President Putin and I will then meet in an agreed upon location, Budapest, Hungary, to see if we can bring this \"inglorious\" War, between Russia and Ukraine, to an end. President Zelenskyy and I will be meeting tomorrow, in the Oval Office, where we will discuss my conversation with President Putin, and much more. I believe great progress was made with today's telephone conversation.",
    "url": "https://x.com/trump_repost/status/1978872484960301387",
    "user": "trump_repost"
  },
  {
    "id": "1978844829477204003",
    "date": "2025-10-16T15:25:47+00:00",
    "content": "I am speaking to President Putin now. The conversation is ongoing, a lengthy one, and I will report the contents, as will President Putin, at its conclusion. Thank you for your attention to this matter!",
    "url": "https://x.com/trump_repost/status/1978844829477204003",
    "user": "trump_repost"
  },
  {
    "id": "1978405839737061458",
    "date": "2025-10-15T10:21:23+00:00",
    "content": "https://t.co/OlNDurELSG",
    "url": "https://x.com/trump_repost/status/1978405839737061458",
    "user": "trump_repost"
  },
  {
    "id": "1978405582068449386",
    "date": "2025-10-15T10:20:22+00:00",
    "content": "https://t.co/V7cIjc7kwx",
    "url": "https://x.com/trump_repost/status/1978405582068449386",
    "user": "trump_repost"
  },
  {
    "id": "1978311494929379831",
    "date": "2025-10-15T04:06:30+00:00",
    "content": "So terrible! https://t.co/b8GT0l2hoT",
    "url": "https://x.com/trump_repost/status/1978311494929379831",
    "user": "trump_repost"
  },
  {
    "id": "1978309966604681223",
    "date": "2025-10-15T04:00:25+00:00",
    "content": "» Denmark Commits $4.2B to Arctic Defense, Backs Trump's Security Vision https://t.co/nbLFoNUaJC",
    "url": "https://x.com/trump_repost/status/1978309966604681223",
    "user": "trump_repost"
  },
  {
    "id": "1978284962227814814",
    "date": "2025-10-15T02:21:04+00:00",
    "content": "https://t.co/ebWzTbvJk0",
    "url": "https://x.com/trump_repost/status/1978284962227814814",
    "user": "trump_repost"
  },
  {
    "id": "1978283579202249066",
    "date": "2025-10-15T02:15:34+00:00",
    "content": "» Playing Golf with President Donald Trump (My Grandpa) https://t.co/SXpArMyS0H",
    "url": "https://x.com/trump_repost/status/1978283579202249066",
    "user": "trump_repost"
  },
  {
    "id": "1978242418081407310",
    "date": "2025-10-14T23:32:01+00:00",
    "content": "Congressman John Moolenaar is an incredible Representative for the fantastic people of Michigan's 2nd Congressional District!\n \nAs the Chairman of the Select Committee on the CCP, John is fighting tirelessly to put our Country's Interests, FIRST! He is working hard to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Support our Brave Military/Veterans, and Defend our always under siege Second Amendment.\n \nJohn Moolenaar has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242418081407310",
    "user": "trump_repost"
  },
  {
    "id": "1978242383067349054",
    "date": "2025-10-14T23:31:52+00:00",
    "content": "Congressman Tom Cole is a Tremendous Champion for Oklahoma's 4th Congressional District!\n \nAs the Chairman of the POWERFUL House Appropriations Committee, Tom knows the America First Policies required to Create GREAT Jobs, Cut Taxes and Regulations, and Champion our Nation's Golden Age. He is fighting tirelessly to Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Strengthen our Military/Veterans, and Defend our always under siege Second Amendment.\n \nTom Cole has my Complete and Total Endorsement for Re-Election — HE WILL NOT LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242383067349054",
    "user": "trump_repost"
  },
  {
    "id": "1978242352436363392",
    "date": "2025-10-14T23:31:45+00:00",
    "content": "Congressman Russell Fry is an America First Patriot, who is doing an incredible job representing South Carolina's 7th Congressional District!\n \nA MAGA Warrior, who has been with us from the very beginning, Russell is working hard to Grow our Economy, Cut Taxes and Regulations, Advance American Energy DOMINANCE, Promote MADE IN THE U.S.A., Keep our now very Secure Border, SECURE, Support our Great Military/Veterans, and Protect our always under siege Second Amendment.\n \nRussell Fry has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242352436363392",
    "user": "trump_repost"
  },
  {
    "id": "1978242321876746447",
    "date": "2025-10-14T23:31:38+00:00",
    "content": "Congressman William Timmons is doing a truly fantastic job representing the wonderful people of South Carolina's 4th Congressional District!\n \nA Captain in the South Carolina Air National Guard, and former Criminal Prosecutor, William knows what it takes to ensure LAW AND ORDER, and strongly supports our incredible Law Enforcement, Military, and Veterans. In Congress, he is fighting tirelessly to Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Champion American Energy DOMINANCE, Keep our now very Secure Border, SECURE, and Protect our always under siege Second Amendment.\n \nWilliam Timmons has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242321876746447",
    "user": "trump_repost"
  },
  {
    "id": "1978242291145011621",
    "date": "2025-10-14T23:31:30+00:00",
    "content": "Congressman Vince Fong is a terrific Representative for the incredible people of California's 20th Congressional District!\n \nVince has a strong Record of SUCCESS, and compelling support from his Community. In Congress, he is fighting tirelessly to Deliver Sustainable Water Solutions, Champion our Amazing Farmers and Ranchers, Grow our Economy, Cut Taxes and Regulations, Keep our now very Secure Border, SECURE, Advocate for our Great Military/Veterans, and Defend our always under siege Second Amendment.\n \nVince Fong has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242291145011621",
    "user": "trump_repost"
  },
  {
    "id": "1978242264733552839",
    "date": "2025-10-14T23:31:24+00:00",
    "content": "Congressman Tim Moore is a Tremendous Champion for North Carolina's 14th Congressional District!\n \nTim served as the Highly Respected Speaker of the North Carolina House of Representatives for a decade, prior to becoming a very distinguished U.S. Congressman. In Congress, he is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Champion American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Murderers, and other Criminals from illegally entering our Country, Strengthen our Great Military/Veterans, and Protect our always under siege Second Amendment.\n \nTim Moore has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242264733552839",
    "user": "trump_repost"
  },
  {
    "id": "1978242242285654276",
    "date": "2025-10-14T23:31:19+00:00",
    "content": "Congresswoman Laurel Lee is an incredible Representative of Florida's 15th Congressional District!\n \nLaurel served as Florida's Secretary of State for three years, and delivered strong results for families, and businesses. In Congress, Laurel is fighting tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote MADE IN THE U.S.A., Ensure American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Champion Innovation, Strengthen our Great Military/Veterans, and Protect our always under siege Second Amendment.\n \nLaurel Lee has my Complete and Total Endorsement — SHE WILL NOT LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242242285654276",
    "user": "trump_repost"
  },
  {
    "id": "1978242207493800088",
    "date": "2025-10-14T23:31:10+00:00",
    "content": "Congresswoman Kat Cammack is doing a fantastic job representing the wonderful people of Florida's 3rd Congressional District!\n \nIn Congress, Kat is working tirelessly to Grow our Economy, Cut Taxes, Promote MADE IN THE U.S.A., Support our Amazing Farmers and Ranchers, Advance American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Champion our Military/Veterans, and Protect our always under siege Second Amendment.\n \nKat Cammack has my Complete and Total Endorsement for Re-Election — SHE WILL NOT LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242207493800088",
    "user": "trump_repost"
  },
  {
    "id": "1978242168423907330",
    "date": "2025-10-14T23:31:01+00:00",
    "content": "Congressman Neal Dunn is a tremendous Representative for the Great People of Florida's 2nd Congressional District!\n \nAn accomplished surgeon, and retired Major in the U.S. Army, Neal knows the Wisdom and Courage necessary to Defend our Country, Support our Brave Military/Veterans, and Ensure PEACE THROUGH STRENGTH. In Congress, Neal is working hard to Grow our Economy, Keep our now very Secure Border, SECURE, Champion American Energy DOMINANCE, and Protect our always under siege Second Amendment.\n \nDr. Neal Dunn has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242168423907330",
    "user": "trump_repost"
  },
  {
    "id": "1978242137650340122",
    "date": "2025-10-14T23:30:54+00:00",
    "content": "Congressman Bob Onder is a MAGA Warrior who is doing a fantastic job representing Missouri's 3rd Congressional District!\n \nA Proven Leader, Bob has served his Community as a Physician, Attorney, and Highly Respected State Legislator, prior to becoming a distinguished Congressman. In Congress, he is working tirelessly to Grow our Economy, Cut Taxes and Regulations, Promote School Choice, Champion American Energy DOMINANCE, Keep our now very Secure Border, SECURE, Stop Migrant Crime, Strengthen our Military/Veterans, and Protect our always under siege Second Amendment.\n \nDr. Bob Onder has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1978242137650340122",
    "user": "trump_repost"
  },
  {
    "id": "1978233229363863592",
    "date": "2025-10-14T22:55:30+00:00",
    "content": "Great meeting today with Javier Milei! He is doing the right things for his Country. I hope the people of Argentina understand how good a job he is doing, and will support his work during the upcoming Midterms, so we can continue to help him achieve Argentina's incredible potential. Javier Milei has my Complete and Total Endorsement — He will not let you down. MAKE ARGENTINA GREAT AGAIN!",
    "url": "https://x.com/trump_repost/status/1978233229363863592",
    "user": "trump_repost"
  },
  {
    "id": "1978199486620221777",
    "date": "2025-10-14T20:41:25+00:00",
    "content": "» President Trump Participates in a Medal of Freedom Ceremony for Charlie Kirk https://t.co/3E6jktCqWu",
    "url": "https://x.com/trump_repost/status/1978199486620221777",
    "user": "trump_repost"
  },
  {
    "id": "1978184314920878223",
    "date": "2025-10-14T19:41:08+00:00",
    "content": "I believe that China purposefully not buying our Soybeans, and causing difficulty for our Soybean Farmers, is an Economically Hostile Act. We are considering terminating business with China having to do with Cooking Oil, and other elements of Trade, as retribution. As an example, we can easily produce Cooking Oil ourselves, we don't need to purchase it from China.",
    "url": "https://x.com/trump_repost/status/1978184314920878223",
    "user": "trump_repost"
  },
  {
    "id": "1978155638275629243",
    "date": "2025-10-14T17:47:11+00:00",
    "content": "Under my Standing Authorities as Commander-in-Chief, this morning, the Secretary of War, ordered a lethal kinetic strike on a vessel affiliated with a Designated Terrorist Organization (DTO) conducting narcotrafficking in the USSOUTHCOM area of responsibility — just off the Coast of Venezuela. Intelligence confirmed the vessel was trafficking narcotics, was associated with illicit narcoterrorist networks, and was transiting along a known DTO route. The strike was conducted in International Waters, and six male narcoterrorists aboard the vessel were killed in the strike. No U.S. Forces were harmed. Thank you for your attention to this matter!!!!!!",
    "url": "https://x.com/trump_repost/status/1978155638275629243",
    "user": "trump_repost"
  },
  {
    "id": "1978149025670144126",
    "date": "2025-10-14T17:20:54+00:00",
    "content": "Don't forget to get a copy of my son Eric's book, \"UNDER SIEGE,\" which is breaking records everywhere. It's a phenomenal book, that's a must read for everyone—Congratulations Eric, you deserve it!!! https://t.co/uQktmNPVLA https://t.co/9DJIvwj8kl",
    "url": "https://x.com/trump_repost/status/1978149025670144126",
    "user": "trump_repost"
  },
  {
    "id": "1978143862649716793",
    "date": "2025-10-14T17:00:23+00:00",
    "content": "ALL TWENTY HOSTAGES ARE BACK AND FEELING AS GOOD AS CAN BE EXPECTED. A big burden has been lifted, but the job IS NOT DONE. THE DEAD HAVE NOT BEEN RETURNED, AS PROMISED! Phase Two begins right NOW!!! President DJT",
    "url": "https://x.com/trump_repost/status/1978143862649716793",
    "user": "trump_repost"
  },
  {
    "id": "1978140259696394309",
    "date": "2025-10-14T16:46:04+00:00",
    "content": "Just got back from the Middle East. What a point in time it was!!! The crowd for Charlie K's Presidential Medal of Freedom presentation is so big and enthusiastic that I moved it out to the new Rose Garden, where everyone can see the Presidential Wall of Fame and the Palm Court renovation. Enter through Main South Entrance.",
    "url": "https://x.com/trump_repost/status/1978140259696394309",
    "user": "trump_repost"
  },
  {
    "id": "1977974132232106301",
    "date": "2025-10-14T05:45:56+00:00",
    "content": "Time Magazine wrote a relatively good story about me, but the picture may be the Worst of All Time. They \"disappeared\" my hair, and then had something floating on top of my head that looked like a floating crown, but an extremely small one. Really weird! I never liked taking pictures from underneath angles, but this is a super bad picture, and deserves to be called out. What are they doing, and why?",
    "url": "https://x.com/trump_repost/status/1977974132232106301",
    "user": "trump_repost"
  },
  {
    "id": "1977974109859623046",
    "date": "2025-10-14T05:45:51+00:00",
    "content": "Heading back home to a very safe and beautiful Washington, D.C. Accomplished so much today in Israel and Egypt. A lot of work, but I wouldn't have it any other way. It was an experience like no other! Now, all of those Great Countries that have fought so long and hard for the Region have to come together and, GET THE JOB DONE! Gaza is only a part of it. The big part is, PEACE IN THE MIDDLE EAST!",
    "url": "https://x.com/trump_repost/status/1977974109859623046",
    "user": "trump_repost"
  },
  {
    "id": "1977966778681852037",
    "date": "2025-10-14T05:16:43+00:00",
    "content": "Jensen Huang: \"President Trump did the Miracle. We are so proud and grateful.\" https://t.co/0gk70ANUMn",
    "url": "https://x.com/trump_repost/status/1977966778681852037",
    "user": "trump_repost"
  },
  {
    "id": "1977962752300953944",
    "date": "2025-10-14T05:00:43+00:00",
    "content": "Giorgia Meloni, the GREAT Prime Minister of Italy, has written a new Book, \"I Am Giorgia: My Roots, My Principles.\" Giorgia is doing an incredible job for the wonderful people of Italy, and this Book explores her journey of Faith, Family, and Love of Country, which gave her the Wisdom and Courage required to serve her Nation, and make her people proud. She is an inspiration to all. Get your copy today! https://t.co/A8hRorXRas",
    "url": "https://x.com/trump_repost/status/1977962752300953944",
    "user": "trump_repost"
  },
  {
    "id": "1977928870738403676",
    "date": "2025-10-14T02:46:05+00:00",
    "content": "https://t.co/FkymMupWQm",
    "url": "https://x.com/trump_repost/status/1977928870738403676",
    "user": "trump_repost"
  },
  {
    "id": "1977813256715870292",
    "date": "2025-10-13T19:06:41+00:00",
    "content": "https://t.co/pI1yHFqcSh",
    "url": "https://x.com/trump_repost/status/1977813256715870292",
    "user": "trump_repost"
  },
  {
    "id": "1977810689600458870",
    "date": "2025-10-13T18:56:29+00:00",
    "content": "https://t.co/koOsX3UX7l",
    "url": "https://x.com/trump_repost/status/1977810689600458870",
    "user": "trump_repost"
  },
  {
    "id": "1977808605731774724",
    "date": "2025-10-13T18:48:12+00:00",
    "content": "RT @RapidResponse47: Pakistani Prime Minister @CMShehbaz praises @POTUS at the Gaza Peace Summit: \"Mr. President, I would like to salute yo…",
    "url": "https://x.com/trump_repost/status/1977808605731774724",
    "user": "trump_repost"
  },
  {
    "id": "1977808377117065491",
    "date": "2025-10-13T18:47:17+00:00",
    "content": "RT @RapidResponse47: .@POTUS: \"With the historic agreement we've just signed, those prayers of millions have finally been answered... Toget…",
    "url": "https://x.com/trump_repost/status/1977808377117065491",
    "user": "trump_repost"
  },
  {
    "id": "1977808167854850489",
    "date": "2025-10-13T18:46:27+00:00",
    "content": "RT @RapidResponse47: Everyone wants a photo with the Leader of the Free World — THE PRESIDENT OF PEACE! https://t.co/1SHKLvdL6u",
    "url": "https://x.com/trump_repost/status/1977808167854850489",
    "user": "trump_repost"
  },
  {
    "id": "1977760456489222201",
    "date": "2025-10-13T15:36:52+00:00",
    "content": "Happy 250th Birthday to the United States Navy! https://t.co/mkTseZ9VKg",
    "url": "https://x.com/trump_repost/status/1977760456489222201",
    "user": "trump_repost"
  },
  {
    "id": "1977736130339717455",
    "date": "2025-10-13T14:00:12+00:00",
    "content": "https://t.co/JsJOqGeFxs",
    "url": "https://x.com/trump_repost/status/1977736130339717455",
    "user": "trump_repost"
  },
  {
    "id": "1977736042712027627",
    "date": "2025-10-13T13:59:51+00:00",
    "content": "RT @RapidResponse47: .@POTUS: \"Generations from now, this will be remembered as the moment that everything began to change... Like the USA…",
    "url": "https://x.com/trump_repost/status/1977736042712027627",
    "user": "trump_repost"
  },
  {
    "id": "1977735114537775156",
    "date": "2025-10-13T13:56:10+00:00",
    "content": "RT @RapidResponse47: .@POTUS: \"This is not only the End of a war—it is the END of an age of terror and death, and the BEGINNING of the age…",
    "url": "https://x.com/trump_repost/status/1977735114537775156",
    "user": "trump_repost"
  },
  {
    "id": "1977734662748307842",
    "date": "2025-10-13T13:54:22+00:00",
    "content": "RT @RapidResponse47: .@POTUS addresses Israel's Knesset: \"After two harrowing years in darkness and captivity, 20 courageous hostages are r…",
    "url": "https://x.com/trump_repost/status/1977734662748307842",
    "user": "trump_repost"
  },
  {
    "id": "1977734295101079747",
    "date": "2025-10-13T13:52:55+00:00",
    "content": "🔁 🅃 @RapidResponse47: President @realDonaldTrump signs the guestbook at the Knesset in Jerusalem 🇺🇸🇮🇱\n\n\"This is my great honor — a great and beautiful day. A new beginning.\"\n\n— Donald J. Trump https://t.co/IionwswF6E",
    "url": "https://x.com/trump_repost/status/1977734295101079747",
    "user": "trump_repost"
  },
  {
    "id": "1977484981334405473",
    "date": "2025-10-12T21:22:14+00:00",
    "content": "https://t.co/DyfzPtnRZQ",
    "url": "https://x.com/trump_repost/status/1977484981334405473",
    "user": "trump_repost"
  },
  {
    "id": "1977466375712162147",
    "date": "2025-10-12T20:08:18+00:00",
    "content": "RT @IsraeliPM: Give @realDonaldTrump the Nobel Peace Prize - he deserves it! 🏅 https://t.co/Hbuc7kmPt1",
    "url": "https://x.com/trump_repost/status/1977466375712162147",
    "user": "trump_repost"
  },
  {
    "id": "1977465890326417534",
    "date": "2025-10-12T20:06:22+00:00",
    "content": "https://t.co/gQfHYogMAE",
    "url": "https://x.com/trump_repost/status/1977465890326417534",
    "user": "trump_repost"
  },
  {
    "id": "1977465802107592808",
    "date": "2025-10-12T20:06:01+00:00",
    "content": "» MORNING GLORY: 'Do you like Trump?' https://t.co/Es15sbHun7",
    "url": "https://x.com/trump_repost/status/1977465802107592808",
    "user": "trump_repost"
  },
  {
    "id": "1977465774605578675",
    "date": "2025-10-12T20:05:54+00:00",
    "content": "Lord Conrad Black: \"Because President Trump did it, there has been little recognition that it is the greatest diplomatic achievement in the Middle East since the founding of the state of Israel and is a gigantic step forward toward peace.\"",
    "url": "https://x.com/trump_repost/status/1977465774605578675",
    "user": "trump_repost"
  },
  {
    "id": "1977465743198580743",
    "date": "2025-10-12T20:05:47+00:00",
    "content": "Throughout most of our History, America's Colleges and Universities have been a Great Strategic Asset of the United States. Tragically, however, much of Higher Education has lost its way, and is now corrupting our Youth and Society with WOKE, SOCIALIST, and ANTI-AMERICAN Ideology that serves as justification for discriminatory practices by Universities that are Unconstitutional and Unlawful. My Administration is fixing this, and FAST, with our Great Reform Agenda in Higher Education. Our Nation's Great Institutions will once again prioritize Merit and Hard Work before \"group identity,\" resulting in tremendous new Research and Opportunity to benefit all Americans, and Equality being honored in American Businesses, Courts, and Culture.\n\nTo those Universities that continue to illegally discriminate based on Race or Sex, we will continue our current efforts to swiftly and forcefully enforce Federal Law. But for those Institutions that want to quickly return to the pursuit of Truth and Achievement, they are invited to enter into a forward looking Agreement with the Federal Government to help bring about the Golden Age of Academic Excellence in Higher Education. They will agree to follow Federal Law, and protect the Civil Rights of ALL Students, Faculty, and Employees on Campuses. They will stop racist Admission Policies, and put an end to unjust and illegal discrimination in Faculty Hiring. These Institutions will commit to High Quality Standards, an Intellectually Open Campus Environment (including the protection of Free Speech and Debate), Institutional Neutrality, major steps toward Affordability for Students, and an end to the entanglement of Foreign Money in the Finances of American Universities. Americans deserve to be treated in accordance with their demonstrated achievements and potential, and upon regaining this fundamentally American Value, our Nation will be unstoppable. We will once again have Universities that develop the talents of our amazing young people to lead lives of Success and Fulfillment, cultivate a Love of Country and a Culture of Achievement, and help make all Americans proud, safe, prosperous, and free!",
    "url": "https://x.com/trump_repost/status/1977465743198580743",
    "user": "trump_repost"
  },
  {
    "id": "1977415425278521580",
    "date": "2025-10-12T16:45:50+00:00",
    "content": "Don't worry about China, it will all be fine! Highly respected President Xi just had a bad moment. He doesn't want Depression for his country, and neither do I. The U.S.A. wants to help China, not hurt it!!! President DJT",
    "url": "https://x.com/trump_repost/status/1977415425278521580",
    "user": "trump_repost"
  },
  {
    "id": "1977390160003424264",
    "date": "2025-10-12T15:05:26+00:00",
    "content": "The Ukraine Impeachment (of me!) Scam was a far bigger Illegal Hoax than Watergate. I sincerely hope the necessary authorities, including CONGRESS, are looking into this! Adam \"Schiffty\" Schiff was sooo dishonest and corrupt. So many laws, and protocols, were violated, and just plain broken!!! President DJT",
    "url": "https://x.com/trump_repost/status/1977390160003424264",
    "user": "trump_repost"
  },
  {
    "id": "1977375288876212374",
    "date": "2025-10-12T14:06:21+00:00",
    "content": "» GREGG JARRETT: The Great Comey Con: How 'Saint James' plans to put Trump on trial instead https://t.co/jzh6QAEtQW",
    "url": "https://x.com/trump_repost/status/1977375288876212374",
    "user": "trump_repost"
  },
  {
    "id": "1977232914716016999",
    "date": "2025-10-12T04:40:36+00:00",
    "content": "THE BIDEN FBI PLACED 274 AGENTS INTO THE CROWD ON JANUARY 6. If this is so, which it is, a lot of very good people will be owed big apologies. What a SCAM - DO SOMETHING!!! President DJT",
    "url": "https://x.com/trump_repost/status/1977232914716016999",
    "user": "trump_repost"
  },
  {
    "id": "1977230448972775561",
    "date": "2025-10-12T04:30:48+00:00",
    "content": "I am pleased to announce that the great Dan Scavino, in addition to remaining Deputy Chief of Staff of the Trump Administration, will head the White House Presidential Personnel Office, replacing Sergio Gor, who did a wonderful job in that position, and will now become the Ambassador to India. Dan will be responsible for the selection and appointment of almost all positions in government, a very big and important position. Congratulations Dan, you will do a fantastic job!!! President DJT",
    "url": "https://x.com/trump_repost/status/1977230448972775561",
    "user": "trump_repost"
  },
  {
    "id": "1977217916979515410",
    "date": "2025-10-12T03:41:00+00:00",
    "content": "Great job by super lawyer Bill Brennan on Fake News CNN. He took the third rate \"anchor\" apart when discussing the legal merit of various cases. They probably won't have him back again. Total losers!!!",
    "url": "https://x.com/trump_repost/status/1977217916979515410",
    "user": "trump_repost"
  },
  {
    "id": "1977108484627087529",
    "date": "2025-10-11T20:26:10+00:00",
    "content": "https://t.co/YamOaeS0iW",
    "url": "https://x.com/trump_repost/status/1977108484627087529",
    "user": "trump_repost"
  },
  {
    "id": "1977065622883463613",
    "date": "2025-10-11T17:35:51+00:00",
    "content": "Chuck Schumer recently said, \"Every day gets better\" during their Radical Left Shutdown. I DISAGREE! If nothing is done, because of \"Leader\" Chuck Schumer and the Democrats, our Brave Troops will miss the paychecks they are rightfully due on October 15th. That is why I am using my authority, as Commander in Chief, to direct our Secretary of War, Pete Hegseth, to use all available funds to get our Troops PAID on October 15th. We have identified funds to do this, and Secretary Hegseth will use them to PAY OUR TROOPS. I will not allow the Democrats to hold our Military, and the entire Security of our Nation, HOSTAGE, with their dangerous Government Shutdown. The Radical Left Democrats should OPEN THE GOVERNMENT, and then we can work together to address Healthcare, and many other things that they want to destroy. Thank you for your attention to this matter!\n \nDONALD J. TRUMP\nPRESIDENT OF THE UNITED STATES OF AMERICA",
    "url": "https://x.com/trump_repost/status/1977065622883463613",
    "user": "trump_repost"
  },
  {
    "id": "1976868362216202742",
    "date": "2025-10-11T04:32:00+00:00",
    "content": "https://t.co/DPJNjSKrTd",
    "url": "https://x.com/trump_repost/status/1976868362216202742",
    "user": "trump_repost"
  },
  {
    "id": "1976868179277467737",
    "date": "2025-10-11T04:31:17+00:00",
    "content": "https://t.co/a7Vt8to9g2",
    "url": "https://x.com/trump_repost/status/1976868179277467737",
    "user": "trump_repost"
  },
  {
    "id": "1976868103427703094",
    "date": "2025-10-11T04:30:58+00:00",
    "content": "» Watters: Isn’t this what Dems wanted? https://t.co/6FDxAVFLiD",
    "url": "https://x.com/trump_repost/status/1976868103427703094",
    "user": "trump_repost"
  },
  {
    "id": "1976868072058429731",
    "date": "2025-10-11T04:30:51+00:00",
    "content": "» COLOSSAL MISTAKE was made here: Laura Ingraham https://t.co/66IwP5tZS5",
    "url": "https://x.com/trump_repost/status/1976868072058429731",
    "user": "trump_repost"
  },
  {
    "id": "1976860633393234414",
    "date": "2025-10-11T04:01:17+00:00",
    "content": "https://t.co/3gH0Z1ntw9",
    "url": "https://x.com/trump_repost/status/1976860633393234414",
    "user": "trump_repost"
  },
  {
    "id": "1976852946467143823",
    "date": "2025-10-11T03:30:45+00:00",
    "content": "A truly AMAZING job by our great U.S. Attorney in D.C. https://t.co/QfHtz2e8VT",
    "url": "https://x.com/trump_repost/status/1976852946467143823",
    "user": "trump_repost"
  },
  {
    "id": "1976753986779988404",
    "date": "2025-10-10T20:57:31+00:00",
    "content": "It has just been learned that China has taken an extraordinarily aggressive position on Trade in sending an extremely hostile letter to the World, stating that they were going to, effective November 1st, 2025, impose large scale Export Controls on virtually every product they make, and some not even made by them. This affects ALL Countries, without exception, and was obviously a plan devised by them years ago. It is absolutely unheard of in International Trade, and a moral disgrace in dealing with other Nations.\n\nBased on the fact that China has taken this unprecedented position, and speaking only for the U.S.A., and not other Nations who were similarly threatened, starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying. Also on November 1st, we will impose Export Controls on any and all critical software.\n\nIt is impossible to believe that China would have taken such an action, but they have, and the rest is History. Thank you for your attention to this matter!\n\nDONALD J. TRUMP\nPRESIDENT OF THE UNITED STATES OF AMERICA",
    "url": "https://x.com/trump_repost/status/1976753986779988404",
    "user": "trump_repost"
  },
  {
    "id": "1976673500078412224",
    "date": "2025-10-10T15:37:41+00:00",
    "content": "https://t.co/Nm6xrpZhMZ",
    "url": "https://x.com/trump_repost/status/1976673500078412224",
    "user": "trump_repost"
  },
  {
    "id": "1976673062985843070",
    "date": "2025-10-10T15:35:57+00:00",
    "content": "https://t.co/qjodDjwXVQ",
    "url": "https://x.com/trump_repost/status/1976673062985843070",
    "user": "trump_repost"
  },
  {
    "id": "1976672620851740983",
    "date": "2025-10-10T15:34:12+00:00",
    "content": "https://t.co/Sma9sjFBE2",
    "url": "https://x.com/trump_repost/status/1976672620851740983",
    "user": "trump_repost"
  },
  {
    "id": "1976672196920738031",
    "date": "2025-10-10T15:32:31+00:00",
    "content": "https://t.co/NnLJmKpbyj",
    "url": "https://x.com/trump_repost/status/1976672196920738031",
    "user": "trump_repost"
  },
  {
    "id": "1976671537114866126",
    "date": "2025-10-10T15:29:53+00:00",
    "content": "Thank you to President Putin! https://t.co/wuYk20yb7Q",
    "url": "https://x.com/trump_repost/status/1976671537114866126",
    "user": "trump_repost"
  },
  {
    "id": "1976671214979736024",
    "date": "2025-10-10T15:28:37+00:00",
    "content": "RT @MariaCorinaYA: Este inmenso reconocimiento a la lucha de todos los venezolanos es un impulso para concluir nuestra tarea: conquistar la…",
    "url": "https://x.com/trump_repost/status/1976671214979736024",
    "user": "trump_repost"
  },
  {
    "id": "1976664270680289364",
    "date": "2025-10-10T15:01:01+00:00",
    "content": "Some very strange things are happening in China! They are becoming very hostile, and sending letters to Countries throughout the World, that they want to impose Export Controls on each and every element of production having to do with Rare Earths, and virtually anything else they can think of, even if it's not manufactured in China. Nobody has ever seen anything like this but, essentially, it would \"clog\" the Markets, and make life difficult for virtually every Country in the World, especially for China. We have been contacted by other Countries who are extremely angry at this great Trade hostility, which came out of nowhere. Our relationship with China over the past six months has been a very good one, thereby making this move on Trade an even more surprising one. I have always felt that they've been lying in wait, and now, as usual, I have been proven right! There is no way that China should be allowed to hold the World \"captive,\" but that seems to have been their plan for quite some time, starting with the \"Magnets\" and, other Elements that they have quietly amassed into somewhat of a Monopoly position, a rather sinister and hostile move, to say the least. But the U.S. has Monopoly positions also, much stronger and more far reaching than China's. I have just not chosen to use them, there was never a reason for me to do so — UNTIL NOW! The letter they sent is many pages long, and details, with great specificity, each and every Element that they want to withhold from other Nations. Things that were routine are no longer routine at all. I have not spoken to President Xi because there was no reason to do so. This was a real surprise, not only to me, but to all the Leaders of the Free World. I was to meet President Xi in two weeks, at APEC, in South Korea, but now there seems to be no reason to do so. The Chinese letters were especially inappropriate in that this was the Day that, after three thousand years of bedlam and fighting, there is PEACE IN THE MIDDLE EAST. I wonder if that timing was coincidental? Dependent on what China says about the hostile \"order\" that they have just put out, I will be forced, as President of the United States of America, to financially counter their move. For every Element that they have been able to monopolize, we have two. I never thought it would come to this but perhaps, as with all things, the time has come. Ultimately, though potentially painful, it will be a very good thing, in the end, for the U.S.A. One of the Policies that we are calculating at this moment is a massive increase of Tariffs on Chinese products coming into the United States of America. There are many other countermeasures that are, likewise, under serious consideration. Thank you for your attention to this matter!\n \nDONALD J. TRUMP, PRESIDENT OF THE UNITED STATES OF AMERICA",
    "url": "https://x.com/trump_repost/status/1976664270680289364",
    "user": "trump_repost"
  },
  {
    "id": "1976607103675728340",
    "date": "2025-10-10T11:13:51+00:00",
    "content": "https://t.co/2rF4gXQcVN",
    "url": "https://x.com/trump_repost/status/1976607103675728340",
    "user": "trump_repost"
  },
  {
    "id": "1976606928970408351",
    "date": "2025-10-10T11:13:10+00:00",
    "content": "https://t.co/8eHV3bQFjE",
    "url": "https://x.com/trump_repost/status/1976606928970408351",
    "user": "trump_repost"
  },
  {
    "id": "1976606743871553979",
    "date": "2025-10-10T11:12:25+00:00",
    "content": "https://t.co/lTFF67XZLo",
    "url": "https://x.com/trump_repost/status/1976606743871553979",
    "user": "trump_repost"
  },
  {
    "id": "1976606560119083399",
    "date": "2025-10-10T11:11:42+00:00",
    "content": "» Hostage deal is testament to Trump's skills: David Friedman | National Report https://t.co/Y34l7R6dxw",
    "url": "https://x.com/trump_repost/status/1976606560119083399",
    "user": "trump_repost"
  },
  {
    "id": "1976606520168333414",
    "date": "2025-10-10T11:11:32+00:00",
    "content": "https://t.co/TIPotC3OSO",
    "url": "https://x.com/trump_repost/status/1976606520168333414",
    "user": "trump_repost"
  },
  {
    "id": "1976605562168336402",
    "date": "2025-10-10T11:07:44+00:00",
    "content": "https://t.co/RrM9Zgj0Ie",
    "url": "https://x.com/trump_repost/status/1976605562168336402",
    "user": "trump_repost"
  },
  {
    "id": "1976605392844255705",
    "date": "2025-10-10T11:07:03+00:00",
    "content": "https://t.co/4yeqx2hrwS",
    "url": "https://x.com/trump_repost/status/1976605392844255705",
    "user": "trump_repost"
  },
  {
    "id": "1976605155119485173",
    "date": "2025-10-10T11:06:07+00:00",
    "content": "https://t.co/79rgaIJzlY",
    "url": "https://x.com/trump_repost/status/1976605155119485173",
    "user": "trump_repost"
  },
  {
    "id": "1976497197303931380",
    "date": "2025-10-10T03:57:08+00:00",
    "content": "https://t.co/MUj1aHPva9",
    "url": "https://x.com/trump_repost/status/1976497197303931380",
    "user": "trump_repost"
  },
  {
    "id": "1976490444885459174",
    "date": "2025-10-10T03:30:18+00:00",
    "content": "» Peace Through Strength: Trump's Gaza Deal + Why He Deserves the Nobel with Matt Boyle and Joel Pollak https://t.co/HX0fhciZsS",
    "url": "https://x.com/trump_repost/status/1976490444885459174",
    "user": "trump_repost"
  },
  {
    "id": "1976489423694070157",
    "date": "2025-10-10T03:26:14+00:00",
    "content": "Christopher Wray is another \"beauty.\" https://t.co/z5OGDefxU7",
    "url": "https://x.com/trump_repost/status/1976489423694070157",
    "user": "trump_repost"
  },
  {
    "id": "1976489401447514155",
    "date": "2025-10-10T03:26:09+00:00",
    "content": "» Angel parents call for Trump to receive Nobel Peace Prize for border security efforts https://t.co/lNvS2dvKnj",
    "url": "https://x.com/trump_repost/status/1976489401447514155",
    "user": "trump_repost"
  },
  {
    "id": "1976472872773353884",
    "date": "2025-10-10T02:20:28+00:00",
    "content": "Thank you Washington Post. Wow!!! https://t.co/iiABDiahs6 https://t.co/Q5zQfxojZy",
    "url": "https://x.com/trump_repost/status/1976472872773353884",
    "user": "trump_repost"
  },
  {
    "id": "1976467924883005938",
    "date": "2025-10-10T02:00:48+00:00",
    "content": "https://t.co/pKgCyX0LcE",
    "url": "https://x.com/trump_repost/status/1976467924883005938",
    "user": "trump_repost"
  },
  {
    "id": "1976461716348391600",
    "date": "2025-10-10T01:36:08+00:00",
    "content": "Thank you!!! https://t.co/KaX66yQS7f",
    "url": "https://x.com/trump_repost/status/1976461716348391600",
    "user": "trump_repost"
  },
  {
    "id": "1976332525963542912",
    "date": "2025-10-09T17:02:47+00:00",
    "content": "https://t.co/faijl3iR2n",
    "url": "https://x.com/trump_repost/status/1976332525963542912",
    "user": "trump_repost"
  },
  {
    "id": "1976320793182339565",
    "date": "2025-10-09T16:16:10+00:00",
    "content": "https://t.co/NrjcgwjAIC",
    "url": "https://x.com/trump_repost/status/1976320793182339565",
    "user": "trump_repost"
  },
  {
    "id": "1976320662974423074",
    "date": "2025-10-09T16:15:38+00:00",
    "content": "https://t.co/9opCeDmGme",
    "url": "https://x.com/trump_repost/status/1976320662974423074",
    "user": "trump_repost"
  },
  {
    "id": "1976320512470225324",
    "date": "2025-10-09T16:15:03+00:00",
    "content": "https://t.co/4OneKEMbU7",
    "url": "https://x.com/trump_repost/status/1976320512470225324",
    "user": "trump_repost"
  },
  {
    "id": "1976320371105333252",
    "date": "2025-10-09T16:14:29+00:00",
    "content": "https://t.co/TqbtzS2CAl",
    "url": "https://x.com/trump_repost/status/1976320371105333252",
    "user": "trump_repost"
  },
  {
    "id": "1976320230176796993",
    "date": "2025-10-09T16:13:55+00:00",
    "content": "https://t.co/hqOFidxL13",
    "url": "https://x.com/trump_repost/status/1976320230176796993",
    "user": "trump_repost"
  },
  {
    "id": "1976320094243627041",
    "date": "2025-10-09T16:13:23+00:00",
    "content": "https://t.co/gwmBCpEvVs",
    "url": "https://x.com/trump_repost/status/1976320094243627041",
    "user": "trump_repost"
  },
  {
    "id": "1976319955827294408",
    "date": "2025-10-09T16:12:50+00:00",
    "content": "https://t.co/ci9akvmcMg",
    "url": "https://x.com/trump_repost/status/1976319955827294408",
    "user": "trump_repost"
  },
  {
    "id": "1976319837094969536",
    "date": "2025-10-09T16:12:22+00:00",
    "content": "https://t.co/gM02biCwi0",
    "url": "https://x.com/trump_repost/status/1976319837094969536",
    "user": "trump_repost"
  },
  {
    "id": "1976319686754304362",
    "date": "2025-10-09T16:11:46+00:00",
    "content": "https://t.co/ylfvSVkbkb",
    "url": "https://x.com/trump_repost/status/1976319686754304362",
    "user": "trump_repost"
  },
  {
    "id": "1976319562145726857",
    "date": "2025-10-09T16:11:16+00:00",
    "content": "RT @marcthiessen: This was the best UNGA address by an American president in my lifetime — and I used to write them!",
    "url": "https://x.com/trump_repost/status/1976319562145726857",
    "user": "trump_repost"
  },
  {
    "id": "1976318762266791995",
    "date": "2025-10-09T16:08:05+00:00",
    "content": "RT @OpenSourceZone: CNN: Voters Trust Republicans More Than Democrats on the big Issues\n\nCrime: 🔴 Republicans +22\nImmigration: 🔴 Republican…",
    "url": "https://x.com/trump_repost/status/1976318762266791995",
    "user": "trump_repost"
  },
  {
    "id": "1976318633514262820",
    "date": "2025-10-09T16:07:35+00:00",
    "content": "RT @marklevinshow: A TREMENDOUS SPEECH AT THE UN BY OUR GREAT PRESIDENT!!\n\nSo proud of our President.  Our President's UN speech was absolu…",
    "url": "https://x.com/trump_repost/status/1976318633514262820",
    "user": "trump_repost"
  },
  {
    "id": "1976318491750957352",
    "date": "2025-10-09T16:07:01+00:00",
    "content": "Tariffs are only good if you want your Country to be Rich, Influential, and Powerful. If you want your Country to be a Third World Country, you should Vote against Tariffs!",
    "url": "https://x.com/trump_repost/status/1976318491750957352",
    "user": "trump_repost"
  },
  {
    "id": "1976318385148526840",
    "date": "2025-10-09T16:06:35+00:00",
    "content": "https://t.co/982V6KxTaT https://t.co/VwPx6buvD3",
    "url": "https://x.com/trump_repost/status/1976318385148526840",
    "user": "trump_repost"
  },
  {
    "id": "1976317798340231548",
    "date": "2025-10-09T16:04:15+00:00",
    "content": "» Chicago Police Ordered to 'Stand Down' as ICE Agent Surrounded – Legal Experts Warn of Criminal Liability https://t.co/zj3aA6FFTh",
    "url": "https://x.com/trump_repost/status/1976317798340231548",
    "user": "trump_repost"
  },
  {
    "id": "1976317774743146907",
    "date": "2025-10-09T16:04:10+00:00",
    "content": "» 2020 Census Gave Dems Decade Of Electoral Advantages https://t.co/W47S4UfD3w",
    "url": "https://x.com/trump_repost/status/1976317774743146907",
    "user": "trump_repost"
  },
  {
    "id": "1976317746674893190",
    "date": "2025-10-09T16:04:03+00:00",
    "content": "RT @mrddmia: Congratulations to @AGPamBondi, U.S. Attorney Jason Reding Quiñones, and @USAO_SDFL prosecution team for winning the criminal…",
    "url": "https://x.com/trump_repost/status/1976317746674893190",
    "user": "trump_repost"
  },
  {
    "id": "1976316915745468580",
    "date": "2025-10-09T16:00:45+00:00",
    "content": "Gary Player: \"The President's speech at the United Nations is without a question one of the greatest speeches I've ever heard, and two of my friends who are not Trump fans are now his big, big fans.\"",
    "url": "https://x.com/trump_repost/status/1976316915745468580",
    "user": "trump_repost"
  },
  {
    "id": "1976313421382689240",
    "date": "2025-10-09T15:46:52+00:00",
    "content": "To all the FBI Agents who were forced by Christopher Wray to go to the Capitol on the afternoon of January 6th, and then risked their careers to blow the whistle about the Political Bias and Abuses they witnessed, I want to thank you for your Courage, and assure you that you now work for a Director, Kash Patel, and an Attorney General, Pam Bondi, who are stamping out Political Bias from the Bureau and DOJ, and making sure Agents pursue criminals without regard to their political stripe, just the evidence. Keep up the good work!",
    "url": "https://x.com/trump_repost/status/1976313421382689240",
    "user": "trump_repost"
  },
  {
    "id": "1976313390386799096",
    "date": "2025-10-09T15:46:45+00:00",
    "content": "https://t.co/8DlayMgT5X",
    "url": "https://x.com/trump_repost/status/1976313390386799096",
    "user": "trump_repost"
  },
  {
    "id": "1976313228826378261",
    "date": "2025-10-09T15:46:06+00:00",
    "content": "Dr. Ben Carson will be an incredible National Nutrition Advisor for the United States Department of Agriculture. I will soon be awarding Dr. Carson the Presidential Medal of Freedom. He is a true American Patriot who cares deeply for the people of our Country, and never stops working to protect and strengthen Life, Liberty, and the Pursuit of Happiness, for all. Congratulations Ben!",
    "url": "https://x.com/trump_repost/status/1976313228826378261",
    "user": "trump_repost"
  },
  {
    "id": "1976295770027659403",
    "date": "2025-10-09T14:36:44+00:00",
    "content": "\"PRESIDENT TRUMP HAS MADE HISTORY\" https://t.co/eMF3Q7Wqi2",
    "url": "https://x.com/trump_repost/status/1976295770027659403",
    "user": "trump_repost"
  },
  {
    "id": "1976255185736638500",
    "date": "2025-10-09T11:55:27+00:00",
    "content": "Thank you to Eylon Levy for your words of Wisdom on FoxNews this morning. A great day in the Middle East!",
    "url": "https://x.com/trump_repost/status/1976255185736638500",
    "user": "trump_repost"
  },
  {
    "id": "1976252699504230470",
    "date": "2025-10-09T11:45:35+00:00",
    "content": "United States Ambassador Mike Huckabee is AMAZING! He worked so hard, and did so much, to bring about Peace in the Middle East. He has very quickly become a Great Man. Thank you Mike!",
    "url": "https://x.com/trump_repost/status/1976252699504230470",
    "user": "trump_repost"
  },
  {
    "id": "1976251533999460695",
    "date": "2025-10-09T11:40:57+00:00",
    "content": "I would like to thank Republican Congressman Brian Mast, of Florida, for his brilliant words and analysis on the return of the Hostages, and Peace in the Middle East, this morning on Fox &amp; Friends. Thank you Brian!!! President DJT",
    "url": "https://x.com/trump_repost/status/1976251533999460695",
    "user": "trump_repost"
  },
  {
    "id": "1976250617346887974",
    "date": "2025-10-09T11:37:18+00:00",
    "content": "RT @trump_repost: I am very proud to announce that Israel and Hamas have both signed off on the first Phase of our Peace Plan. This means t…",
    "url": "https://x.com/trump_repost/status/1976250617346887974",
    "user": "trump_repost"
  },
  {
    "id": "1976123333617061953",
    "date": "2025-10-09T03:11:31+00:00",
    "content": "https://t.co/dio83C98M3",
    "url": "https://x.com/trump_repost/status/1976123333617061953",
    "user": "trump_repost"
  },
  {
    "id": "1976064421987483956",
    "date": "2025-10-08T23:17:26+00:00",
    "content": "https://t.co/X1UdKe9Yo5",
    "url": "https://x.com/trump_repost/status/1976064421987483956",
    "user": "trump_repost"
  },
  {
    "id": "1976059084500836381",
    "date": "2025-10-08T22:56:13+00:00",
    "content": "I am very proud to announce that Israel and Hamas have both signed off on the first Phase of our Peace Plan. This means that ALL of the Hostages will be released very soon, and Israel will withdraw their Troops to an agreed upon line as the first steps toward a Strong, Durable, and Everlasting Peace. All Parties will be treated fairly! This is a GREAT Day for the Arab and Muslim World, Israel, all surrounding Nations, and the United States of America, and we thank the mediators from Qatar, Egypt, and Turkey, who worked with us to make this Historic and Unprecedented Event happen. BLESSED ARE THE PEACEMAKERS!\n\nDONALD J. TRUMP\nPRESIDENT OF THE UNITED STATES OF AMERICA",
    "url": "https://x.com/trump_repost/status/1976059084500836381",
    "user": "trump_repost"
  },
  {
    "id": "1976047686341231032",
    "date": "2025-10-08T22:10:56+00:00",
    "content": "https://t.co/I9Ga3dWIPa",
    "url": "https://x.com/trump_repost/status/1976047686341231032",
    "user": "trump_repost"
  },
  {
    "id": "1976046433641103365",
    "date": "2025-10-08T22:05:57+00:00",
    "content": "https://t.co/m6BwYSL5xg",
    "url": "https://x.com/trump_repost/status/1976046433641103365",
    "user": "trump_repost"
  },
  {
    "id": "1975975779679994273",
    "date": "2025-10-08T17:25:12+00:00",
    "content": "» Op-Ed: Rep. Andy Barr: Why I'm leading legislation to put Trump on a new $250 bill https://t.co/ujyof0i6N6",
    "url": "https://x.com/trump_repost/status/1975975779679994273",
    "user": "trump_repost"
  },
  {
    "id": "1975944454814228879",
    "date": "2025-10-08T15:20:43+00:00",
    "content": "Congressman Jeff Van Drew is a \"MAGA\" Warrior for the incredible people of New Jersey's 2nd Congressional District!\n \nAs the Chairman of the House Judiciary Subcommittee on Oversight, Jeff is doing a tremendous job advancing our America First Agenda. He is working tirelessly to Grow our Economy, Cut Taxes and Regulations, Help Secure our already Secure Border, Stop Migrant Crime, Murderers, and other Criminals from illegally entering our Country, Strengthen our Military/Veterans, Champion American Energy DOMINANCE, and Defend our always under siege Second Amendment.\n \nJeff Van Drew is a very good friend, fighter, and WINNER, and has my Complete and Total Endorsement for Re-Election — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1975944454814228879",
    "user": "trump_repost"
  },
  {
    "id": "1975939492860297246",
    "date": "2025-10-08T15:01:00+00:00",
    "content": "Congressman Chris Smith is a fantastic Representative for the wonderful people of New Jersey's 4th Congressional District!\n \nAs a Senior Member of the House Committee on Foreign Affairs, Chris is fighting tirelessly to advance our America First Agenda. He is working hard to Grow our Economy, Create GREAT Jobs, Promote MADE IN THE U.S.A., Champion American Energy DOMINANCE, Help Secure our already Secure Border, Strengthen our Military/Veterans, Defend our always under siege Second Amendment, and Ensure PEACE THROUGH STRENGTH.\n \nChris Smith has my Complete and Total Endorsement for Re-Election — HE WILL NOT LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1975939492860297246",
    "user": "trump_repost"
  },
  {
    "id": "1975938242701865066",
    "date": "2025-10-08T14:56:02+00:00",
    "content": "Florida Attorney General James Uthmeier is doing a GREAT job for the Sunshine State, which I won BIG in 2016, 2020, and 2024.\n \nJames is an America First Warrior, who is a true champion for \"MAGA.\" He is THE MAN behind ALLIGATOR ALCATRAZ, and argued strongly at the United States Supreme Court in defense of my Executive Power to fire Deep State bureaucrats. Under James' fearless leadership, over 1,000 CRIMINAL PEDOPHILES have been arrested, missing children have been SAVED, and our Great Members of Law Enforcement have been empowered to do their jobs and, KEEP FLORIDA SAFE. In his next term, James will continue to work tirelessly to Ensure Law and Order, Uphold our Constitutional Rights, and Protect our always under siege Second Amendment.\n \nJames Uthmeier is a Strong Conservative Fighter and Prosecutor, and has my Complete and Total Endorsement — HE WILL NOT LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1975938242701865066",
    "user": "trump_repost"
  },
  {
    "id": "1975900338290041112",
    "date": "2025-10-08T12:25:25+00:00",
    "content": "Chicago Mayor should be in jail for failing to protect Ice Officers! Governor Pritzker also!",
    "url": "https://x.com/trump_repost/status/1975900338290041112",
    "user": "trump_repost"
  },
  {
    "id": "1975777247933145573",
    "date": "2025-10-08T04:16:18+00:00",
    "content": "https://t.co/krsvdrlnEI",
    "url": "https://x.com/trump_repost/status/1975777247933145573",
    "user": "trump_repost"
  },
  {
    "id": "1975777155931119754",
    "date": "2025-10-08T04:15:56+00:00",
    "content": "https://t.co/cmLpfrEjNe",
    "url": "https://x.com/trump_repost/status/1975777155931119754",
    "user": "trump_repost"
  },
  {
    "id": "1975777079859007771",
    "date": "2025-10-08T04:15:38+00:00",
    "content": "RT @trump_repost: Pregnant Women, DON'T USE TYLENOL UNLESS ABSOLUTELY NECESSARY, DON'T GIVE TYLENOL TO YOUR YOUNG CHILD FOR VIRTUALLY ANY R…",
    "url": "https://x.com/trump_repost/status/1975777079859007771",
    "user": "trump_repost"
  },
  {
    "id": "1975774672232063019",
    "date": "2025-10-08T04:06:04+00:00",
    "content": "https://t.co/O3ldHnV2Op",
    "url": "https://x.com/trump_repost/status/1975774672232063019",
    "user": "trump_repost"
  },
  {
    "id": "1975774589482611077",
    "date": "2025-10-08T04:05:44+00:00",
    "content": "MAKE CHICAGO SAFE AGAIN! https://t.co/xKCQ05szQf",
    "url": "https://x.com/trump_repost/status/1975774589482611077",
    "user": "trump_repost"
  },
  {
    "id": "1975774567135404534",
    "date": "2025-10-08T04:05:39+00:00",
    "content": "My goal is very simple. STOP CRIME IN AMERICA! https://t.co/F2FOODFYmQ",
    "url": "https://x.com/trump_repost/status/1975774567135404534",
    "user": "trump_repost"
  },
  {
    "id": "1975744362580459983",
    "date": "2025-10-08T02:05:38+00:00",
    "content": "RT @marklevinshow: I think Pam Bondi, Kash Patel, and Dan Bongino are doing a great job.  Thanks to them all.",
    "url": "https://x.com/trump_repost/status/1975744362580459983",
    "user": "trump_repost"
  },
  {
    "id": "1975744272801620128",
    "date": "2025-10-08T02:05:16+00:00",
    "content": "Wow! Jack Smith and the Biden DOJ spied on Republican Senators and a least one Republican Congressman. This is really bad \"stuff.\" They tried to take down the Republican Party, and got caught!!!",
    "url": "https://x.com/trump_repost/status/1975744272801620128",
    "user": "trump_repost"
  },
  {
    "id": "1975738160199172173",
    "date": "2025-10-08T01:40:59+00:00",
    "content": "Congratulations to Matt Van Epps on his great victory in Tennessee. He will be a GREAT Congressman!!! President DJT",
    "url": "https://x.com/trump_repost/status/1975738160199172173",
    "user": "trump_repost"
  },
  {
    "id": "1975735484833013979",
    "date": "2025-10-08T01:30:21+00:00",
    "content": "Sanctimonious Richard \"Da Nang Dick\" Blumenthal, perhaps the biggest \"joke\" in the United States Senate, is at it again! \"Dick\" lied until the midpoint of his political career, convincing everyone, in particular the Fake News Media, that he was a great \"War Hero\" who lived on the precipice of death in the jungles of Vietnam. He would talk about his life in the military in almost every speech, in particular the death defying dangers he faced in his many years \"fight for freedom\" while in Vietnam. He stated that \"the battles were violent and long, but there was no going back\" - And then it happened, Blumenthal was found out to be a FRAUD. The soldiers in his so-called \"platoon\" came forward and said that they had no idea who this guy was. He was revealed, broke down and admitted, tears flowing from his eyes, that he LIED, a Whopper, one that lasted 20 year. This guy shouldn't even be in the U.S. Senate. It should be investigated, and Justice should be sought. Right now there is a Congressman sitting in prison for lying about his past during a campaign. Well, those lies were nothing compared to those of Richard \"Da Nang Dick\" Blumenthal, perhaps the greatest phony in the history of the United States Senate. He should be allowed to speak no longer!",
    "url": "https://x.com/trump_repost/status/1975735484833013979",
    "user": "trump_repost"
  },
  {
    "id": "1975608611624919507",
    "date": "2025-10-07T17:06:12+00:00",
    "content": "https://t.co/lnOyGzhLKS",
    "url": "https://x.com/trump_repost/status/1975608611624919507",
    "user": "trump_repost"
  },
  {
    "id": "1975599869198025111",
    "date": "2025-10-07T16:31:28+00:00",
    "content": "https://t.co/uKnAsHlFrh",
    "url": "https://x.com/trump_repost/status/1975599869198025111",
    "user": "trump_repost"
  },
  {
    "id": "1975593524029710655",
    "date": "2025-10-07T16:06:15+00:00",
    "content": "https://t.co/nsKe3zuw0X",
    "url": "https://x.com/trump_repost/status/1975593524029710655",
    "user": "trump_repost"
  },
  {
    "id": "1975593376218230957",
    "date": "2025-10-07T16:05:40+00:00",
    "content": "» SCHUMER SHUTDOWN: Trump, Republicans Expose Democrat Schemes to Give Taxpayer Benefits to Illegal Aliens https://t.co/xPqOTB20gp",
    "url": "https://x.com/trump_repost/status/1975593376218230957",
    "user": "trump_repost"
  },
  {
    "id": "1975592523000426905",
    "date": "2025-10-07T16:02:16+00:00",
    "content": "» Government shutdown is Democrats' political weapon against American families https://t.co/ry8iTiD9nz",
    "url": "https://x.com/trump_repost/status/1975592523000426905",
    "user": "trump_repost"
  },
  {
    "id": "1975592442453008535",
    "date": "2025-10-07T16:01:57+00:00",
    "content": "https://t.co/dJwD79wZk6",
    "url": "https://x.com/trump_repost/status/1975592442453008535",
    "user": "trump_repost"
  },
  {
    "id": "1975592342838223163",
    "date": "2025-10-07T16:01:33+00:00",
    "content": "» Trump Vows to Get Service Members 'Every Last Penny' During Shutdown https://t.co/bt9ZmRNqC5",
    "url": "https://x.com/trump_repost/status/1975592342838223163",
    "user": "trump_repost"
  },
  {
    "id": "1975592298928087196",
    "date": "2025-10-07T16:01:23+00:00",
    "content": "» GENIUS: Trump's Intel Investment Skyrockets 50 Percent in One Month https://t.co/W7PPAdpK97",
    "url": "https://x.com/trump_repost/status/1975592298928087196",
    "user": "trump_repost"
  },
  {
    "id": "1975592247132590540",
    "date": "2025-10-07T16:01:11+00:00",
    "content": "» Maine investigates claim that 250 unmarked ballots found in Amazon box https://t.co/Zx4VuQVddG",
    "url": "https://x.com/trump_repost/status/1975592247132590540",
    "user": "trump_repost"
  },
  {
    "id": "1975592215566237956",
    "date": "2025-10-07T16:01:03+00:00",
    "content": "» Trump slams Democrats for 'shutting down' government, demands it reopen 'tonight' https://t.co/G0emxovTqM",
    "url": "https://x.com/trump_repost/status/1975592215566237956",
    "user": "trump_repost"
  },
  {
    "id": "1975545451895238743",
    "date": "2025-10-07T12:55:14+00:00",
    "content": "VOTE TODAY! It is my Great Honor to endorse America First Patriot Matt Van Epps, who is running to represent the Great People of Tennessee's 7th Congressional District.\n \nA West Point Graduate, and Combat Decorated Army Helicopter Pilot, Matt knows the WISDOM and COURAGE required to Defend our Country, Support our Incredible Military/Veterans, and Ensure PEACE THROUGH STRENGTH. In Congress, Matt will work hard to Keep our now very Secure Border, SECURE, Stop Migrant Crime, Grow our Economy, Cut Taxes, Promote MADE IN THE U.S.A., Champion School Choice, Unleash American Energy DOMINANCE, and Defend our always under siege Second Amendment. He is strongly supported by my good friend, Congressman Jim Jordan, and many other highly respected MAGA Warriors!\n \nMatt Van Epps has my Complete and Total Endorsement to be the next Congressman from Tennessee's 7th Congressional District — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1975545451895238743",
    "user": "trump_repost"
  },
  {
    "id": "1975534402328535336",
    "date": "2025-10-07T12:11:19+00:00",
    "content": "Deranged Jack Smith got caught with his hand in the cookie jar. A real sleazebag!!!",
    "url": "https://x.com/trump_repost/status/1975534402328535336",
    "user": "trump_repost"
  },
  {
    "id": "1975534367650029946",
    "date": "2025-10-07T12:11:11+00:00",
    "content": "Great interview by highly respected Congressman Michael Baumgartner, Republican of the Great State of Washington, on Maria Bartiromo's (Who is, by the way, also FANTASTIC!) Show. He really gets it. Thank you Michael! President DJT",
    "url": "https://x.com/trump_repost/status/1975534367650029946",
    "user": "trump_repost"
  },
  {
    "id": "1975334168419807650",
    "date": "2025-10-06T22:55:40+00:00",
    "content": "Democrats have SHUT DOWN the United States Government right in the midst of one of the most successful Economies, including a Record Stock Market, that our Country has ever had. This has sadly affected so many programs, services, and other elements of Society that Americans rely on — And it should not have happened. I am happy to work with the Democrats on their Failed Healthcare Policies, or anything else, but first they must allow our Government to re-open. In fact, they should open our Government tonight!",
    "url": "https://x.com/trump_repost/status/1975334168419807650",
    "user": "trump_repost"
  },
  {
    "id": "1975285602255081773",
    "date": "2025-10-06T19:42:41+00:00",
    "content": "RT @FBIDirectorKash: Career FBI agents, intel analysts, and staff led the investigation into Comey and others. They called the balls and st…",
    "url": "https://x.com/trump_repost/status/1975285602255081773",
    "user": "trump_repost"
  },
  {
    "id": "1975277289089999073",
    "date": "2025-10-06T19:09:39+00:00",
    "content": "RT @nicksortor: 🚨 BREAKING: FBI Director Kash Patel has just FIRED the agents who kneeled during the George Floyd riots in 2020, per AP\n\nFI…",
    "url": "https://x.com/trump_repost/status/1975277289089999073",
    "user": "trump_repost"
  },
  {
    "id": "1975276860977361405",
    "date": "2025-10-06T19:07:57+00:00",
    "content": "RT @FBIDirectorKash: Today, your FBI took another step in its promise of full accountability. For far too long, previous corrupt leadership…",
    "url": "https://x.com/trump_repost/status/1975276860977361405",
    "user": "trump_repost"
  },
  {
    "id": "1975276431073841573",
    "date": "2025-10-06T19:06:14+00:00",
    "content": "https://t.co/QR6J5dbMzA",
    "url": "https://x.com/trump_repost/status/1975276431073841573",
    "user": "trump_repost"
  },
  {
    "id": "1975257513600958769",
    "date": "2025-10-06T17:51:04+00:00",
    "content": "» Exclusive: Team Trump Scored Nearly One Billion Views in September, Crushing Dems https://t.co/obePqEQGIv",
    "url": "https://x.com/trump_repost/status/1975257513600958769",
    "user": "trump_repost"
  },
  {
    "id": "1975257486455415175",
    "date": "2025-10-06T17:50:57+00:00",
    "content": "» SCOOP: Tylenol Maker Privately Admitted Evidence Was Getting 'Heavy' For Autism Risk In 2018 https://t.co/U3hntKIcyy",
    "url": "https://x.com/trump_repost/status/1975257486455415175",
    "user": "trump_repost"
  },
  {
    "id": "1975257453643374825",
    "date": "2025-10-06T17:50:50+00:00",
    "content": "https://t.co/qV4toaEUfd https://t.co/ibQYf4NUwX",
    "url": "https://x.com/trump_repost/status/1975257453643374825",
    "user": "trump_repost"
  },
  {
    "id": "1975257371497931017",
    "date": "2025-10-06T17:50:30+00:00",
    "content": "» Exclusive — Qatari Prime Minister: Donald Trump Is 'Only One' in the World Who Can Achieve Peace in Gaza https://t.co/zXNXQ8qPbf",
    "url": "https://x.com/trump_repost/status/1975257371497931017",
    "user": "trump_repost"
  },
  {
    "id": "1975257331115172003",
    "date": "2025-10-06T17:50:20+00:00",
    "content": "https://t.co/0kZxAIJteJ https://t.co/zwxXT6GBK2",
    "url": "https://x.com/trump_repost/status/1975257331115172003",
    "user": "trump_repost"
  },
  {
    "id": "1975256266168770653",
    "date": "2025-10-06T17:46:06+00:00",
    "content": "Beginning November 1st, 2025, all Medium and Heavy Duty Trucks coming into the United States from other Countries will be Tariffed at the Rate of 25%. Thank you for your attention to this matter!",
    "url": "https://x.com/trump_repost/status/1975256266168770653",
    "user": "trump_repost"
  },
  {
    "id": "1975239806738416028",
    "date": "2025-10-06T16:40:42+00:00",
    "content": "This morning, I had a very good telephone call with President Lula, of Brazil. We discussed many things, but it was mostly focused on the Economy, and Trade, between our two Countries. We will be having further discussions, and will get together in the not too distant future, both in Brazil and the United States. I enjoyed the call — Our Countries will do very well together!",
    "url": "https://x.com/trump_repost/status/1975239806738416028",
    "user": "trump_repost"
  },
  {
    "id": "1975230720294756541",
    "date": "2025-10-06T16:04:36+00:00",
    "content": "GOD BLESS THE UNITED STATES NAVY! https://t.co/UaGRwzUE7B",
    "url": "https://x.com/trump_repost/status/1975230720294756541",
    "user": "trump_repost"
  },
  {
    "id": "1975216131855221038",
    "date": "2025-10-06T15:06:38+00:00",
    "content": "https://t.co/dCqsBvUrqS",
    "url": "https://x.com/trump_repost/status/1975216131855221038",
    "user": "trump_repost"
  },
  {
    "id": "1975200815955791949",
    "date": "2025-10-06T14:05:46+00:00",
    "content": "https://t.co/YCXQIgj3JY",
    "url": "https://x.com/trump_repost/status/1975200815955791949",
    "user": "trump_repost"
  },
  {
    "id": "1975198238232965294",
    "date": "2025-10-06T13:55:32+00:00",
    "content": "Japan has just elected its first female Prime Minister, a highly respected person of great wisdom and strength. This is tremendous news for the incredible people of Japan. Congratulations to all! President Donald J. Trump",
    "url": "https://x.com/trump_repost/status/1975198238232965294",
    "user": "trump_repost"
  },
  {
    "id": "1975169769134534672",
    "date": "2025-10-06T12:02:24+00:00",
    "content": "MAKE AMERICA GREAT AGAIN!!!",
    "url": "https://x.com/trump_repost/status/1975169769134534672",
    "user": "trump_repost"
  },
  {
    "id": "1975169738738372955",
    "date": "2025-10-06T12:02:17+00:00",
    "content": "JUST OUT: Good news for the Holiday Season. EARLY PRICES ARE DOWN, WHILE TARIFFS ARE MAKING OUR COUNTRY AN ECONOMIC POWER AGAIN. Also, virtually NO INFLATION, AS STOCK MARKETS CONTINUALLY HIT RECORD HIGHS. THE BEST OF ALL WORLDS FOR THE U.S.A.",
    "url": "https://x.com/trump_repost/status/1975169738738372955",
    "user": "trump_repost"
  },
  {
    "id": "1975169715778838963",
    "date": "2025-10-06T12:02:11+00:00",
    "content": "https://t.co/ojTELiQk6i",
    "url": "https://x.com/trump_repost/status/1975169715778838963",
    "user": "trump_repost"
  },
  {
    "id": "1975169505732268039",
    "date": "2025-10-06T12:01:21+00:00",
    "content": "https://t.co/yXH4DjKzxO",
    "url": "https://x.com/trump_repost/status/1975169505732268039",
    "user": "trump_repost"
  },
  {
    "id": "1975169414585815256",
    "date": "2025-10-06T12:00:59+00:00",
    "content": "https://t.co/oAOYj9oQbH",
    "url": "https://x.com/trump_repost/status/1975169414585815256",
    "user": "trump_repost"
  },
  {
    "id": "1975037416676442404",
    "date": "2025-10-06T03:16:29+00:00",
    "content": "https://t.co/HGdt2XhZha",
    "url": "https://x.com/trump_repost/status/1975037416676442404",
    "user": "trump_repost"
  },
  {
    "id": "1974982216922136635",
    "date": "2025-10-05T23:37:08+00:00",
    "content": "https://t.co/8Xa7W9OqnW",
    "url": "https://x.com/trump_repost/status/1974982216922136635",
    "user": "trump_repost"
  },
  {
    "id": "1974978273416507635",
    "date": "2025-10-05T23:21:28+00:00",
    "content": "I knew Al Sharpton for many years, not that it matters, but he was a major \"TRUMP\" fan. He'd ask me to go to his fake Rallies all the time, because I brought BIG Crowds, and he couldn't get anybody to come without me. Then he did the Tawana Brawley Hoax, one of the worst Low Level Scams in History, and that set him back, BIG TIME! Then he got to know Brian Roberts, Chairman of Fake News NBC, who gave him what would become one of the Lowest Rated Shows in Television History. Roberts is afraid to take him off because it wouldn't be \"Politically Correct.\" This is just one of the many reasons that the Federal Communications Commission should look into the license of NBC, which shows almost exclusively positive Democrat content. Likewise, ABC Fake News — About the same thing, 97% negative to Republicans!",
    "url": "https://x.com/trump_repost/status/1974978273416507635",
    "user": "trump_repost"
  },
  {
    "id": "1974978214989795574",
    "date": "2025-10-05T23:21:14+00:00",
    "content": "Before I became President, \"OPEC\" kept Oil prices high. It wasn't right for them to do that but, in a different form, is being done again — This time by the Big Homebuilders of our Nation. They're my friends, and they're very important to the SUCCESS of our Country, but now, they can get Financing, and they have to start building Homes. They're sitting on 2 Million empty lots, A RECORD. I'm asking Fannie Mae and Freddie Mac to get Big Homebuilders going and, by so doing, help restore the American Dream!",
    "url": "https://x.com/trump_repost/status/1974978214989795574",
    "user": "trump_repost"
  },
  {
    "id": "1974973879815979042",
    "date": "2025-10-05T23:04:00+00:00",
    "content": "RT @RapidResponse47: \"The U.S. Navy always stands for America. As Commander-in-Chief, I will always stand up you,\" says @POTUS.\n\n\"I want yo…",
    "url": "https://x.com/trump_repost/status/1974973879815979042",
    "user": "trump_repost"
  },
  {
    "id": "1974973711515312592",
    "date": "2025-10-05T23:03:20+00:00",
    "content": "RT @RapidResponse47: .@POTUS: We are honored to be joined today by service members representing every part of this great Naval tradition —…",
    "url": "https://x.com/trump_repost/status/1974973711515312592",
    "user": "trump_repost"
  },
  {
    "id": "1974957986088153092",
    "date": "2025-10-05T22:00:51+00:00",
    "content": "There have been very positive discussions with Hamas, and Countries from all over the World (Arab, Muslim, and everyone else) this weekend, to release the Hostages, end the War in Gaza but, more importantly, finally have long sought PEACE in the Middle East. These talks have been very successful, and proceeding rapidly. The technical teams will again meet Monday, in Egypt, to work through and clarify the final details. I am told that the first phase should be completed this week, and I am asking everyone to MOVE FAST. I will continue to monitor this Centuries old \"conflict.\" TIME IS OF THE ESSENCE OR, MASSIVE BLOODSHED WILL FOLLOW — SOMETHING THAT NOBODY WANTS TO SEE!",
    "url": "https://x.com/trump_repost/status/1974957986088153092",
    "user": "trump_repost"
  },
  {
    "id": "1974864933008650339",
    "date": "2025-10-05T15:51:05+00:00",
    "content": "Why is FoxNews and Peter Doocy putting on Democrat Senator Mark Kelly to talk about, totally unabated or challenged, Healthcare? The FAKE SPIN is so bad for Republicans that it is hard to believe that we WIN. It will be very unfair, in the future, when they don't have \"TRUMP\" to fight for them. Therefore, we should fix it, NOW! I'm watching this Interview. It just doesn't end. Fox should either get on board, or get off board, NOW, but at this point, it just doesn't make any difference to me. They suck up the Ratings because of us, and then spin them in the Democrats' direction. They refuse to put up Polls that correctly show me at 65% in Popularity, a Republican RECORD, but if I have a fake bad \"Poll,\" many of which are done by Fox (One of the worst \"Pollsters\" out there is the FoxNews Poll), they put them up immediately, and with gusto. Republicans are so tired of this fight with Fox always trying to be so \"politically correct!\" Thank you for your attention to this matter.",
    "url": "https://x.com/trump_repost/status/1974864933008650339",
    "user": "trump_repost"
  },
  {
    "id": "1974863766954340473",
    "date": "2025-10-05T15:46:27+00:00",
    "content": "It has just come out that the Radical Left Lunatic, Jay Jones, who is running against Jason Miyares, the GREAT Attorney General in Virginia, made SICK and DEMENTED jokes, if they were jokes at all, which were not funny, and that he wrote down and sent around to people, concerning the murdering of a Republican Legislator, his wife, and their children. Abigail Spanberger, who is running for Governor, is weak and ineffective, and refuses to acknowledge what this Lunatic has done. Even Democrats are saying it is \"RESIGNATION FROM CAMPAIGN\" TERRITORY. Democrat Jay Jones should drop out of the Race, IMMEDIATELY, and the People of Virginia must continue to have a GREAT Attorney General in Jason Miyares who, by the way, has my Complete and Total Endorsement — JASON WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1974863766954340473",
    "user": "trump_repost"
  },
  {
    "id": "1974854908294869262",
    "date": "2025-10-05T15:11:15+00:00",
    "content": "https://t.co/dLwySCAjtv https://t.co/gsXFWX7add",
    "url": "https://x.com/trump_repost/status/1974854908294869262",
    "user": "trump_repost"
  },
  {
    "id": "1974842258106237224",
    "date": "2025-10-05T14:20:59+00:00",
    "content": "It will be a big day with the Navy. Leaving now. The United States has the greatest military, by far, in the World. This will be a show of Naval aptitude and strength. ENJOY WATCHING! It will be broadcast everywhere. President DJT",
    "url": "https://x.com/trump_repost/status/1974842258106237224",
    "user": "trump_repost"
  },
  {
    "id": "1974651074524135640",
    "date": "2025-10-05T01:41:18+00:00",
    "content": "» Trump presses Google to restore Hispanic network Univision to its YouTubeTV platform https://t.co/FHxFyl1Kbz",
    "url": "https://x.com/trump_repost/status/1974651074524135640",
    "user": "trump_repost"
  },
  {
    "id": "1974604429316993258",
    "date": "2025-10-04T22:35:56+00:00",
    "content": "https://t.co/MrxlqF3RV0",
    "url": "https://x.com/trump_repost/status/1974604429316993258",
    "user": "trump_repost"
  },
  {
    "id": "1974604354062893396",
    "date": "2025-10-04T22:35:39+00:00",
    "content": "https://t.co/WN7Z1cJ8Wd",
    "url": "https://x.com/trump_repost/status/1974604354062893396",
    "user": "trump_repost"
  },
  {
    "id": "1974601879956193334",
    "date": "2025-10-04T22:25:49+00:00",
    "content": "I hope Univision, a great and very popular Hispanic Network, can get BACK onto the very amazing Google/YouTube. It has been taken out of their package, which is VERY BAD for Republicans in the upcoming Midterms. They were so good to me with their highest rated ever political Special, and I set a Republican Record in Hispanic voting. Google, for the purpose of FAIRNESS, please let Univision back! President DJT",
    "url": "https://x.com/trump_repost/status/1974601879956193334",
    "user": "trump_repost"
  },
  {
    "id": "1974578026806661296",
    "date": "2025-10-04T20:51:02+00:00",
    "content": "https://t.co/2MZu9I6II7",
    "url": "https://x.com/trump_repost/status/1974578026806661296",
    "user": "trump_repost"
  },
  {
    "id": "1974566736986087862",
    "date": "2025-10-04T20:06:10+00:00",
    "content": "After negotiations, Israel has agreed to the initial withdrawal line, which we have shown to, and shared with, Hamas. When Hamas confirms, the Ceasefire will be IMMEDIATELY effective, the Hostages and Prisoner Exchange will begin, and we will create the conditions for the next phase of withdrawal, which will bring us close to the end of this 3,000 YEAR CATASTROPHE. Thank you for your attention to this matter and, STAY TUNED!",
    "url": "https://x.com/trump_repost/status/1974566736986087862",
    "user": "trump_repost"
  },
  {
    "id": "1974566644044451851",
    "date": "2025-10-04T20:05:48+00:00",
    "content": "Corrupt Letitia James is costing New York State Hundreds of Billions of Dollars in lost business. No company or individual wants to be there, knowing that she's the \"Attorney General.\" She is a Complete and Total Disaster, who tried running against Kathy Hochul for Governor, and only got 1% of the Vote in Polls, and QUIT. She then went back to her WITCH HUNT against President Donald J. Trump, and others. Until this \"SCUM\" is removed from the Attorney General's Office, no company will move to New York, and few companies will be using the New York Stock Exchange, or NASDAQ, for going Public. The new Texas Exchange will be taking ALL of this business away, and we're talking Hundreds of Billions of Dollars!",
    "url": "https://x.com/trump_repost/status/1974566644044451851",
    "user": "trump_repost"
  },
  {
    "id": "1974496121033822436",
    "date": "2025-10-04T15:25:34+00:00",
    "content": "I appreciate that Israel has temporarily stopped the bombing in order to give the Hostage release and Peace Deal a chance to be completed. Hamas must move quickly, or else all bets will be off. I will not tolerate delay, which many think will happen, or any outcome where Gaza poses a threat again. Let's get this done, FAST. Everyone will be treated fairly!",
    "url": "https://x.com/trump_repost/status/1974496121033822436",
    "user": "trump_repost"
  },
  {
    "id": "1974261075081142648",
    "date": "2025-10-03T23:51:34+00:00",
    "content": "RT @nicksortor: 🚨 BREAKING: The Trump administration has just cancelled $8 BILLION in Green New Scam funding, per OMB Director Vought\n\nTake…",
    "url": "https://x.com/trump_repost/status/1974261075081142648",
    "user": "trump_repost"
  },
  {
    "id": "1974256093691064397",
    "date": "2025-10-03T23:31:47+00:00",
    "content": "To ICE, Border Patrol, Law Enforcement, and all U.S. Military: As per my August 25, 2025 Executive Order, please be advised that, from this point forward, anybody burning the American Flag will be subject to one year in prison. You will be immediately arrested. Thank you for your attention to this matter!",
    "url": "https://x.com/trump_repost/status/1974256093691064397",
    "user": "trump_repost"
  },
  {
    "id": "1974244850527539347",
    "date": "2025-10-03T22:47:06+00:00",
    "content": "https://t.co/Y2x6GsvULe",
    "url": "https://x.com/trump_repost/status/1974244850527539347",
    "user": "trump_repost"
  },
  {
    "id": "1974238511219028464",
    "date": "2025-10-03T22:21:55+00:00",
    "content": "I am proud to announce that on Sunday, October 5th, I will be hosting a Salute to the Fleet in Norfolk, Virginia, to honor our brave men and women of the United States Navy. Our wonderful First Lady, as well as our great Secretary of War, Pete Hegseth, and Secretary of the Navy, John Phelan, will be joining me as we mark 250 years of MARITIME DOMINANCE in the United States of America! Chuck Schumer, Hakeem Jeffries, and the other Minority Radical Left Democrats tried their best, through the ridiculous Government Shutdown, to destroy this wonderful celebration of the U.S. Navy's Birthday, and to stop our Military Servicemembers from celebrating American Naval History. However, I believe, \"THE SHOW MUST GO ON!\" The U.S. Navy has been planning this event for many months and, despite the Democrats' incompetence, I refuse to let them down as their Commander-in-Chief. This will be the largest Celebration in the History of the Navy. Thousands of our brave Active Duty Servicemembers and Military Families will be in attendance, and I look forward to this special day with all of them. See you on Sunday!",
    "url": "https://x.com/trump_repost/status/1974238511219028464",
    "user": "trump_repost"
  },
  {
    "id": "1974221876055687361",
    "date": "2025-10-03T21:15:49+00:00",
    "content": "Based on the Statement just issued by Hamas, I believe they are ready for a lasting PEACE. Israel must immediately stop the bombing of Gaza, so that we can get the Hostages out safely and quickly! Right now, it's far too dangerous to do that. We are already in discussions on details to be worked out. This is not about Gaza alone, this is about long sought PEACE in the Middle East.",
    "url": "https://x.com/trump_repost/status/1974221876055687361",
    "user": "trump_repost"
  },
  {
    "id": "1974214678797513147",
    "date": "2025-10-03T20:47:13+00:00",
    "content": "https://t.co/lFjinY8eMD",
    "url": "https://x.com/trump_repost/status/1974214678797513147",
    "user": "trump_repost"
  },
  {
    "id": "1974175465410834764",
    "date": "2025-10-03T18:11:24+00:00",
    "content": "It is my Great Honor to endorse America First Patriot Matt Van Epps, who is running to represent the Great People of Tennessee's 7th Congressional District.\n \nA West Point Graduate, and Combat Decorated Army Helicopter Pilot, Matt knows the WISDOM and COURAGE required to Defend our Country, Support our Incredible Military/Veterans, and Ensure PEACE THROUGH STRENGTH. In Congress, Matt will work hard to Keep our now very Secure Border, SECURE, Stop Migrant Crime, Grow our Economy, Cut Taxes, Promote MADE IN THE U.S.A., Champion School Choice, Unleash American Energy DOMINANCE, and Defend our always under siege Second Amendment. He is strongly supported by my good friend, Congressman Jim Jordan, and many other highly respected MAGA Warriors!\n \nMatt Van Epps has my Complete and Total Endorsement to be the next Congressman from Tennessee's 7th Congressional District — HE WILL NEVER LET YOU DOWN!",
    "url": "https://x.com/trump_repost/status/1974175465410834764",
    "user": "trump_repost"
  },
  {
    "id": "1974161831095906702",
    "date": "2025-10-03T17:17:13+00:00",
    "content": "A boat loaded with enough drugs to kill 25 TO 50 THOUSAND PEOPLE was stopped, early this morning off the Coast of Venezuela, from entering American Territory. https://t.co/yrgtRscbJ5",
    "url": "https://x.com/trump_repost/status/1974161831095906702",
    "user": "trump_repost"
  },
  {
    "id": "1974154038725030222",
    "date": "2025-10-03T16:46:15+00:00",
    "content": "I am pleased to advise that I reversed the cuts made to Homeland Security and Counterterrorism for New York City and State. It was my Honor to do so. Thank you for your attention to this matter! President DJT",
    "url": "https://x.com/trump_repost/status/1974154038725030222",
    "user": "trump_repost"
  },
  {
    "id": "1974140145466302750",
    "date": "2025-10-03T15:51:03+00:00",
    "content": "Congratulations to Idaho on breaking ground for your new Veterans Home today. Glad to have worked with your GREAT Senator Jim Risch to have made this happen. Veterans are a priority for us!",
    "url": "https://x.com/trump_repost/status/1974140145466302750",
    "user": "trump_repost"
  },
  {
    "id": "1974134089415602542",
    "date": "2025-10-03T15:26:59+00:00",
    "content": "https://t.co/yFRy4X9HJV",
    "url": "https://x.com/trump_repost/status/1974134089415602542",
    "user": "trump_repost"
  },
  {
    "id": "1974133843503558856",
    "date": "2025-10-03T15:26:00+00:00",
    "content": "https://t.co/Cl74ZSGyCK",
    "url": "https://x.com/trump_repost/status/1974133843503558856",
    "user": "trump_repost"
  },
  {
    "id": "1974114989666615756",
    "date": "2025-10-03T14:11:05+00:00",
    "content": "Hamas has been a ruthless and violent threat, for many years, in the Middle East! They have killed (and made lives unbearably miserable), culminating with the October 7th MASSACRE, in Israel, babies, woman, children, old people, and many young men and women, boys and girls, getting ready to celebrate their future lives together. As retribution for the October 7th attack on civilization, more than 25,000 Hamas \"soldiers\" have already been killed. Most of the rest are surrounded and MILITARILY TRAPPED, just waiting for me to give the word, \"GO,\" for their lives to be quickly extinguished. As for the rest, we know where and who you are, and you will be hunted down, and killed. I am asking that all innocent Palestinians immediately leave this area of potentially great future death for safer parts of Gaza. Everyone will be well cared for by those that are waiting to help. Fortunately for Hamas, however, they will be given one last chance! Great, powerful, and very rich Nations of the Middle East, and the surrounding areas beyond, together with the United States of America, have agreed, with Israel signing on, to PEACE, after 3000 years, in the Middle East. THIS DEAL ALSO SPARES THE LIVES OF ALL REMAINING HAMAS FIGHTERS! The details of the document are known to the WORLD, and it is a great one for ALL! We will have PEACE in the Middle East one way or the other. The violence and bloodshed will stop. RELEASES THE HOSTAGES, ALL OF THEM, INCLUDING THE BODIES OF THOSE THAT ARE DEAD, NOW! An Agreement must be reached with Hamas by Sunday Evening at SIX (6) P.M., Washington, D.C. time. Every Country has signed on! If this LAST CHANCE agreement is not reached, all HELL, like no one has ever seen before, will break out against Hamas. THERE WILL BE PEACE IN THE MIDDLE EAST ONE WAY OR THE OTHER. Thank you for your attention to this matter! PRESIDENT DONALD J. TRUMP",
    "url": "https://x.com/trump_repost/status/1974114989666615756",
    "user": "trump_repost"
  },
  {
    "id": "1973956386364309947",
    "date": "2025-10-03T03:40:51+00:00",
    "content": "» FBI Bombshell: 274 agents sent to Capitol for J6, many later complained they were political 'pawns' https://t.co/iBMpB1ZGzX",
    "url": "https://x.com/trump_repost/status/1973956386364309947",
    "user": "trump_repost"
  },
  {
    "id": "1973956359466143959",
    "date": "2025-10-03T03:40:45+00:00",
    "content": "» FBI had three informants reporting Biden corruption in Ukraine, but no record of real investigation https://t.co/f9cRfIJj3H",
    "url": "https://x.com/trump_repost/status/1973956359466143959",
    "user": "trump_repost"
  },
  {
    "id": "1973953994063294831",
    "date": "2025-10-03T03:31:21+00:00",
    "content": "https://t.co/ctsrhBUuBo",
    "url": "https://x.com/trump_repost/status/1973953994063294831",
    "user": "trump_repost"
  },
  {
    "id": "1973947906987340111",
    "date": "2025-10-03T03:07:09+00:00",
    "content": "https://t.co/QbYpr7DjNh",
    "url": "https://x.com/trump_repost/status/1973947906987340111",
    "user": "trump_repost"
  },
  {
    "id": "1973943209471717632",
    "date": "2025-10-03T02:48:29+00:00",
    "content": "https://t.co/C5xEknh4Ah",
    "url": "https://x.com/trump_repost/status/1973943209471717632",
    "user": "trump_repost"
  },
  {
    "id": "1973943112918766050",
    "date": "2025-10-03T02:48:06+00:00",
    "content": "RT @JulieOnX24: @WarlordDilley @itsreallyleah @BrandieWithABee @Shovelmouth365 All eyes are on Russ Vought today. 😅No pressure. https://t.c…",
    "url": "https://x.com/trump_repost/status/1973943112918766050",
    "user": "trump_repost"
  },
  {
    "id": "1973942755362783549",
    "date": "2025-10-03T02:46:41+00:00",
    "content": "https://t.co/ybxn9t8hH8",
    "url": "https://x.com/trump_repost/status/1973942755362783549",
    "user": "trump_repost"
  },
  {
    "id": "1973941700067537004",
    "date": "2025-10-03T02:42:30+00:00",
    "content": "https://t.co/1d4EF3BwJr",
    "url": "https://x.com/trump_repost/status/1973941700067537004",
    "user": "trump_repost"
  },
  {
    "id": "1973941506521379138",
    "date": "2025-10-03T02:41:43+00:00",
    "content": "https://t.co/vOlObO0Uh6",
    "url": "https://x.com/trump_repost/status/1973941506521379138",
    "user": "trump_repost"
  },
  {
    "id": "1973941434450682103",
    "date": "2025-10-03T02:41:26+00:00",
    "content": "https://t.co/C3pKxSfMe4",
    "url": "https://x.com/trump_repost/status/1973941434450682103",
    "user": "trump_repost"
  },
  {
    "id": "1973939585798582720",
    "date": "2025-10-03T02:34:05+00:00",
    "content": "https://t.co/kOUU5I8bLO",
    "url": "https://x.com/trump_repost/status/1973939585798582720",
    "user": "trump_repost"
  },
  {
    "id": "1973939502822666333",
    "date": "2025-10-03T02:33:46+00:00",
    "content": "WOW!!! Such an! honor. Record \"stuff\" for a Republican. President DJT",
    "url": "https://x.com/trump_repost/status/1973939502822666333",
    "user": "trump_repost"
  },
  {
    "id": "1973916220723536309",
    "date": "2025-10-03T01:01:15+00:00",
    "content": "» Government Shutdown Clock https://t.co/3cBUDyZbK8",
    "url": "https://x.com/trump_repost/status/1973916220723536309",
    "user": "trump_repost"
  },
  {
    "id": "1973724910053937478",
    "date": "2025-10-02T12:21:03+00:00",
    "content": "Best thing that could happen to the Republican Party? A Communist Mayor in NYC. The Dems have gone stone cold CRAZY! President DJT https://t.co/9VbDvGHlwV",
    "url": "https://x.com/trump_repost/status/1973724910053937478",
    "user": "trump_repost"
  },
  {
    "id": "1973719904718311514",
    "date": "2025-10-02T12:01:09+00:00",
    "content": "I have a meeting today with Russ Vought, he of PROJECT 2025 Fame, to determine which of the many Democrat Agencies, most of which are a political SCAM, he recommends to be cut, and whether or not those cuts will be temporary or permanent. I can't believe the Radical Left Democrats gave me this unprecedented opportunity. They are not stupid people, so maybe this is their way of wanting to, quietly and quickly, MAKE AMERICA GREAT AGAIN! President DJT",
    "url": "https://x.com/trump_repost/status/1973719904718311514",
    "user": "trump_repost"
  },
  {
    "id": "1973717068890755402",
    "date": "2025-10-02T11:49:53+00:00",
    "content": "THE DEMOCRATS WANT TO GIVE YOUR HEALTHCARE MONEY TO ILLEGAL ALIENS AND OPEN OUR BORDERS TO THE CRIMINALS OF THE WORLD, A DEADLY COMBINATION BECAUSE EVERYBODY WILL COME!",
    "url": "https://x.com/trump_repost/status/1973717068890755402",
    "user": "trump_repost"
  },
  {
    "id": "1973717047164178815",
    "date": "2025-10-02T11:49:48+00:00",
    "content": "RT @trump_repost: 🔁 🅃 JMUGA https://t.co/WVtYB5Wpx3",
    "url": "https://x.com/trump_repost/status/1973717047164178815",
    "user": "trump_repost"
  },
  {
    "id": "1973716801164058786",
    "date": "2025-10-02T11:48:49+00:00",
    "content": "🔁 🅃 boothbr: This is why we put him in office. Promises made, promises kept",
    "url": "https://x.com/trump_repost/status/1973716801164058786",
    "user": "trump_repost"
  },
  {
    "id": "1973716422787493997",
    "date": "2025-10-02T11:47:19+00:00",
    "content": "🔁 🅃 Saddleup1966: Now America can see the difference between a DEI hire like Joe Biden and merit base hire like President Trump.",
    "url": "https://x.com/trump_repost/status/1973716422787493997",
    "user": "trump_repost"
  },
  {
    "id": "1973582956359983442",
    "date": "2025-10-02T02:56:58+00:00",
    "content": "🔁 🅃 JMUGA https://t.co/WVtYB5Wpx3",
    "url": "https://x.com/trump_repost/status/1973582956359983442",
    "user": "trump_repost"
  },
  {
    "id": "1973582535348330819",
    "date": "2025-10-02T02:55:18+00:00",
    "content": "🔁 🅃 IStandWithTrump47 (@Lara_maga47) https://t.co/OCvmLOKwUS",
    "url": "https://x.com/trump_repost/status/1973582535348330819",
    "user": "trump_repost"
  },
  {
    "id": "1973582440221516097",
    "date": "2025-10-02T02:54:55+00:00",
    "content": "🔁 🅃 Qanon76 https://t.co/Hj6VD6UpSC",
    "url": "https://x.com/trump_repost/status/1973582440221516097",
    "user": "trump_repost"
  },
  {
    "id": "1973582227058683972",
    "date": "2025-10-02T02:54:04+00:00",
    "content": "🔁 🅃 kallitout: Jerome Powell, expiration date, May 2026 can't come fast enough. https://t.co/VaWoPrfe49",
    "url": "https://x.com/trump_repost/status/1973582227058683972",
    "user": "trump_repost"
  },
  {
    "id": "1973582113841807814",
    "date": "2025-10-02T02:53:37+00:00",
    "content": "🔁 🅃 IStandWithTrump47 (@Lara_maga47): Daily reminder, this is not going away! We need accountability! https://t.co/b0fuQbZLuy",
    "url": "https://x.com/trump_repost/status/1973582113841807814",
    "user": "trump_repost"
  },
  {
    "id": "1973580137976451408",
    "date": "2025-10-02T02:45:46+00:00",
    "content": "Republicans must use this opportunity of Democrat forced closure to clear out dead wood, waste, and fraud. Billions of Dollars can be saved. MAKE AMERICA GREAT AGAIN!",
    "url": "https://x.com/trump_repost/status/1973580137976451408",
    "user": "trump_repost"
  },
  {
    "id": "1973531113424560325",
    "date": "2025-10-01T23:30:58+00:00",
    "content": "\"Statements of Support for Middle East Peace Deal\" https://t.co/rtY9jMSrMo",
    "url": "https://x.com/trump_repost/status/1973531113424560325",
    "user": "trump_repost"
  },
  {
    "id": "1973485923640987895",
    "date": "2025-10-01T20:31:24+00:00",
    "content": "Maxine Waters admitted that she is demanding Healthcare for Illegal Aliens, and it's going to be Top of the Line, taking American Taxpayers' Healthcare away from them!",
    "url": "https://x.com/trump_repost/status/1973485923640987895",
    "user": "trump_repost"
  },
  {
    "id": "1973450489854632039",
    "date": "2025-10-01T18:10:36+00:00",
    "content": "I really believe that Jerome \"Too Late\" Powell is an OBSTRUCTIONIST!",
    "url": "https://x.com/trump_repost/status/1973450489854632039",
    "user": "trump_repost"
  },
  {
    "id": "1973446639085088971",
    "date": "2025-10-01T17:55:18+00:00",
    "content": "The Soybean Farmers of our Country are being hurt because China is, for \"negotiating\" reasons only, not buying. We've made so much money on Tariffs, that we are going to take a small portion of that money, and help our Farmers. I WILL NEVER LET OUR FARMERS DOWN! Sleepy Joe Biden didn't enforce our Agreement with China, where they were going to purchase Billions of Dollars of our Farm Product, but Soybeans, in particular. It's all going to work out very well. I LOVE OUR PATRIOTS, AND EVERY FARMER IS EXACTLY THAT! I'll be meeting with President Xi, of China, in four weeks, and Soybeans will be a major topic of discussion. MAKE SOYBEANS, AND OTHER ROW CROPS, GREAT AGAIN!",
    "url": "https://x.com/trump_repost/status/1973446639085088971",
    "user": "trump_repost"
  },
  {
    "id": "1973442901704352100",
    "date": "2025-10-01T17:40:27+00:00",
    "content": "The Governor of Oregon must be living in a \"Dream World.\" Portland is a NEVER-ENDING DISASTER. Many people have been badly hurt, and even killed. It is run like a Third World Country. We're only going in because, as American Patriots, WE HAVE NO CHOICE. LAW AND ORDER MUST PREVAIL IN OUR CITIES, AND EVERYWHERE ELSE!",
    "url": "https://x.com/trump_repost/status/1973442901704352100",
    "user": "trump_repost"
  },
  {
    "id": "1973442875301191758",
    "date": "2025-10-01T17:40:20+00:00",
    "content": "As I determined on September 27th, when I activated and called into service the National Guard in Oregon, conditions continue to deteriorate into lawless mayhem. Our GREAT Federal Law Enforcement Officers have not been able to enforce the Laws in Oregon. ANTIFA and the Radical Left Anarchists have been viciously attacking our Federal Law Enforcement Officers, men and women who are simply doing their job, protecting Federal Property, and enforcing Federal Immigration Laws and the Rule of Law. We will never allow MOBS to take over our streets, burn our Cities, or destroy America. The National Guard is now in place, and has been dedicated to restoring LAW AND ORDER, and ending the Chaos, Death, and Destruction! We are a Nation of LAW, and we will PREVAIL. Thank you for your attention to this matter! President DJT",
    "url": "https://x.com/trump_repost/status/1973442875301191758",
    "user": "trump_repost"
  },
  {
    "id": "1973378744237826441",
    "date": "2025-10-01T13:25:30+00:00",
    "content": "https://t.co/xcLinYoo1o",
    "url": "https://x.com/trump_repost/status/1973378744237826441",
    "user": "trump_repost"
  },
  {
    "id": "1973378664160174517",
    "date": "2025-10-01T13:25:11+00:00",
    "content": "I was there to see it all. Total Scum!!! President DJT https://t.co/UNPKPb4c7Y",
    "url": "https://x.com/trump_repost/status/1973378664160174517",
    "user": "trump_repost"
  },
  {
    "id": "1973184402277732476",
    "date": "2025-10-01T00:33:16+00:00",
    "content": "https://t.co/qrCWns4jQK",
    "url": "https://x.com/trump_repost/status/1973184402277732476",
    "user": "trump_repost"
  },
  {
    "id": "1973184116993696205",
    "date": "2025-10-01T00:32:08+00:00",
    "content": "https://t.co/xxia9y4jbu",
    "url": "https://x.com/trump_repost/status/1973184116993696205",
    "user": "trump_repost"
  },
  {
    "id": "1973184037809430584",
    "date": "2025-10-01T00:31:49+00:00",
    "content": "https://t.co/Z30eqNAFNm",
    "url": "https://x.com/trump_repost/status/1973184037809430584",
    "user": "trump_repost"
  },
  {
    "id": "1973183959275368845",
    "date": "2025-10-01T00:31:30+00:00",
    "content": "https://t.co/y3NGHXCEnt",
    "url": "https://x.com/trump_repost/status/1973183959275368845",
    "user": "trump_repost"
  },
  {
    "id": "1973164181206737223",
    "date": "2025-09-30T23:12:55+00:00",
    "content": "RT @narendramodi: We welcome President Donald J. Trump’s announcement of  a comprehensive plan to end the Gaza conflict. It provides a viab…",
    "url": "https://x.com/trump_repost/status/1973164181206737223",
    "user": "trump_repost"
  },
  {
    "id": "1973123739685626276",
    "date": "2025-09-30T20:32:13+00:00",
    "content": "\"President Donald J. Trump Announces First Deal to Bring Most-Favored-Nation Pricing to American Patients\" https://t.co/oA4yBARWDr https://t.co/9PfvVcZEo5",
    "url": "https://x.com/trump_repost/status/1973123739685626276",
    "user": "trump_repost"
  },
  {
    "id": "1973066947882578107",
    "date": "2025-09-30T16:46:32+00:00",
    "content": "https://t.co/vFQ0oSi9UA",
    "url": "https://x.com/trump_repost/status/1973066947882578107",
    "user": "trump_repost"
  },
  {
    "id": "1972871862213587010",
    "date": "2025-09-30T03:51:20+00:00",
    "content": "https://t.co/tBfuC6HVU0",
    "url": "https://x.com/trump_repost/status/1972871862213587010",
    "user": "trump_repost"
  },
  {
    "id": "1972822689103675714",
    "date": "2025-09-30T00:35:57+00:00",
    "content": "https://t.co/aQgsY2zZYz",
    "url": "https://x.com/trump_repost/status/1972822689103675714",
    "user": "trump_repost"
  },
  {
    "id": "1972698066399658255",
    "date": "2025-09-29T16:20:44+00:00",
    "content": "https://t.co/bpdOTEHxfZ",
    "url": "https://x.com/trump_repost/status/1972698066399658255",
    "user": "trump_repost"
  },
  {
    "id": "1972648973472350672",
    "date": "2025-09-29T13:05:39+00:00",
    "content": "In order to make North Carolina, which has completely lost its furniture business to China, and other Countries, GREAT again, I will be imposing substantial Tariffs on any Country that does not make its furniture in the United States. Details to follow!!! President DJT",
    "url": "https://x.com/trump_repost/status/1972648973472350672",
    "user": "trump_repost"
  },
  {
    "id": "1972647932240568557",
    "date": "2025-09-29T13:01:31+00:00",
    "content": "Our movie making business has been stolen from the United States of America, by other Countries, just like stealing \"candy from a baby.\" California, with its weak and incompetent Governor, has been particularly hard hit! Therefore, in order to solve this long time, never ending problem, I will be imposing a 100% Tariff on any and all movies that are made outside of the United States. Thank you for your attention to this matter. MAKE AMERICA GREAT AGAIN! President DJT",
    "url": "https://x.com/trump_repost/status/1972647932240568557",
    "user": "trump_repost"
  },
  {
    "id": "1972643974952452464",
    "date": "2025-09-29T12:45:48+00:00",
    "content": "Self proclaimed New York City Communist, Zohran Mamdani, who is running for Mayor, will prove to be one of the best things to ever happen to our great Republican Party. He is going to have problems with Washington like no Mayor in the history of our once great City. Remember, he needs the money from me, as President, in order to fulfill all of his FAKE Communist promises. He won't be getting any of it, so what's the point of voting for him? This ideology has failed, always, for thousands of years. It will fail again, and that's guaranteed! President DJT",
    "url": "https://x.com/trump_repost/status/1972643974952452464",
    "user": "trump_repost"
  },
  {
    "id": "1972501877691707765",
    "date": "2025-09-29T03:21:09+00:00",
    "content": "Hard to watch the new NFL kickoff. It's wrong on every level. They should end it, immediately. Bad for the game of football! President DJT",
    "url": "https://x.com/trump_repost/status/1972501877691707765",
    "user": "trump_repost"
  },
  {
    "id": "1972478761217184064",
    "date": "2025-09-29T01:49:18+00:00",
    "content": "Yes, I'm watching. Congratulations! https://t.co/4jMjKIZz9x",
    "url": "https://x.com/trump_repost/status/1972478761217184064",
    "user": "trump_repost"
  },
  {
    "id": "1972441434390462801",
    "date": "2025-09-28T23:20:58+00:00",
    "content": "RT @TRUMP_ARMY_: 🚨 BREAKING: In a stunning move, Oklahoma becomes the first state where EVERY SINGLE high school will have its own Turning…",
    "url": "https://x.com/trump_repost/status/1972441434390462801",
    "user": "trump_repost"
  },
  {
    "id": "1972440520099233810",
    "date": "2025-09-28T23:17:20+00:00",
    "content": "RT @NathanielSami: Good job President Trump! Chicago is begging for Trump to save it Step aside Gov. Pritzker.!!! https://t.co/8EcarErRXM",
    "url": "https://x.com/trump_repost/status/1972440520099233810",
    "user": "trump_repost"
  },
  {
    "id": "1972440342382399909",
    "date": "2025-09-28T23:16:38+00:00",
    "content": "RT @WyattCatarina: So many people need to hear this speech, Charlie your so wise beyond your years.  Islam will suffocate the US, just as i…",
    "url": "https://x.com/trump_repost/status/1972440342382399909",
    "user": "trump_repost"
  },
  {
    "id": "1972440187239371163",
    "date": "2025-09-28T23:16:01+00:00",
    "content": "RT @SaltyGoat17: This is awesome!!\n\nWho’s ready to see Adam Schiff in prison? https://t.co/bThXRQMT9Y",
    "url": "https://x.com/trump_repost/status/1972440187239371163",
    "user": "trump_repost"
  },
  {
    "id": "1972440124911943727",
    "date": "2025-09-28T23:15:46+00:00",
    "content": "RT @DOGE__news: Trump absolutely demolished Jim Acosta here.\n\nhttps://t.co/sM1avaNdDp",
    "url": "https://x.com/trump_repost/status/1972440124911943727",
    "user": "trump_repost"
  },
  {
    "id": "1972440048252674302",
    "date": "2025-09-28T23:15:28+00:00",
    "content": "RT @DOGE__news: Dying former miss Wisconsin delivers tearful thank you to Trump.\n\nhttps://t.co/1DUq7Vy2xJ",
    "url": "https://x.com/trump_repost/status/1972440048252674302",
    "user": "trump_repost"
  },
  {
    "id": "1972439982435655917",
    "date": "2025-09-28T23:15:12+00:00",
    "content": "RT @EricLDaugh: 🚨 HOLY CRAP! Ryder Cup crowd in New York goes CRAZY for President Trump and his granddaughter Kai, breaks out into chants o…",
    "url": "https://x.com/trump_repost/status/1972439982435655917",
    "user": "trump_repost"
  },
  {
    "id": "1972439788717580778",
    "date": "2025-09-28T23:14:26+00:00",
    "content": "RT @MAGAARMY_: 🚨 ALERT: President Donald Trump has dropped a bombshell, suggesting he is exploring legislation to eliminate the capital gai…",
    "url": "https://x.com/trump_repost/status/1972439788717580778",
    "user": "trump_repost"
  },
  {
    "id": "1972439092618301523",
    "date": "2025-09-28T23:11:40+00:00",
    "content": "RT @KarluskaP: The Great Replacement is no longer conspiracy theory! https://t.co/n8pHHVyo97",
    "url": "https://x.com/trump_repost/status/1972439092618301523",
    "user": "trump_repost"
  },
  {
    "id": "1972438442744361169",
    "date": "2025-09-28T23:09:05+00:00",
    "content": "RT @LucaTaner: @EricLDaugh Beautiful sight. Let the libs cry lol",
    "url": "https://x.com/trump_repost/status/1972438442744361169",
    "user": "trump_repost"
  },
  {
    "id": "1972437771345367492",
    "date": "2025-09-28T23:06:25+00:00",
    "content": "RT @EricLDaugh: 🚨 WOW! The federal takeover in Chicago is ramping up - MANY US Border Patrol agents were spotted roaming the sidewalks on N…",
    "url": "https://x.com/trump_repost/status/1972437771345367492",
    "user": "trump_repost"
  }
]